[
    {
        "rule": "wcag:1.2.1",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Audio and video-only content can be understood by more people.</dd>\n<dt>What to do</dt>\n<dd>Provide an alternative when content is perceivable with only one sense.</dd>\n<dt>Why it's important</dt>\n<dd>People who can’t fully see or hear content can understand it.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to make information conveyed by prerecorded\n                  audio-only and prerecorded video-only content available to all users. Alternatives\n                  for time-based media that are text based make information accessible because text\n                  can be rendered through any sensory modality (for example, visual, auditory or tactile)\n                  to match the needs of the user. In the future, text could also be translated into\n                  symbols, sign language or simpler forms of the language (future).\n                  \n               </p>\n<p>An example of pre-recorded video with no audio information or user interaction is\n                  a silent movie. The purpose of the transcript is to provide an equivalent to what\n                  is presented visually. For prerecorded video content, authors have the option to provide\n                  an audio track. The purpose of the audio alternative is to be an equivalent to the\n                  video. This makes it possible for users with and without vision impairment to review\n                  content simultaneously. The approach can also make it easier for those with cognitive,\n                  language and learning disabilities to understand the content because it would provide\n                  parallel presentation.\n                  \n               </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<div>\n<p>A text equivalent is not required for audio that is provided as an equivalent for\n                        video with no audio information.  For example, it is not required to caption audio\n                        description that is provided as an alternative to a silent movie.\n                        \n                     </p>\n</div>\n</div>\n<p>See also \n                  <a href=\"audio-only-live\">1.2.4: Audio-only (Live)</a>\n</p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>This Success Criterion helps people who have difficulty perceiving visual content.\n                     Assistive technology can read text alternatives aloud, present them visually, or convert\n                     them to braille.\n                     \n                  </li>\n<li>Alternatives for timed-based media that are text based may help some people who have\n                     difficulty understanding the meaning of prerecorded video content.\n                     \n                  </li>\n<li>People who are deaf, are hard of hearing, or who are having trouble understanding\n                     audio information for any reason can read the text presentation. Research is ongoing\n                     regarding automatic translation of text into sign language.\n                     \n                  </li>\n<li>People who are deaf-blind can read the text in braille.</li>\n<li>Additionally, text supports the ability to search for non-text content and to repurpose\n                     content in a variety of ways.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>An audio recording of a speech</dt>\n<dd>The link to an audio clip says, \"Chairman's speech to the assembly.\" A link to a text\n                     transcript is provided immediately after the link to the audio clip.\n                  </dd>\n<dt>An audio recording of a press conference</dt>\n<dd>A Web page includes a link to an audio recording of a press conference that identifies\n                     the audio recording. The page also links to a text transcript of the press conference.\n                     The transcript includes a verbatim record of everything the speakers say. It identifies\n                     who is speaking as well as noting other significant sounds that are part of the recording,\n                     such as applause, laughter, questions from the audience, and so on.\n                  </dd>\n<dt>An animation that illustrates how a car engine works</dt>\n<dd>An animation shows how a car engine works. There is no audio and the animation is\n                     part of a tutorial that describes how an engine works. Since the text of the tutorial\n                     already provides a full explanation, the media is an alternative for text and the\n                     text alternative includes only a brief description of the animation and refers to\n                     the tutorial text for more information.\n                  </dd>\n<dt>A video-only file with an audio track</dt>\n<dd>A silent movie includes an audio track which includes a description of the action\n                     in the video.\n                  </dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>\n<a href=\"http://www.rnib.org.uk/travel-downloads-podcasts-and-apps?List=be9c76d3-7ad0-4e03-a1a0-e6f6953b8178&amp;ID=16\">Overcoming the challenge of podcast transcription</a>\n</li>\n<li>\n<a href=\"http://www.uiaccess.com/transcripts/transcript_services.html\">uiAccess list of transcription services</a>\n</li>\n<li>\n<a href=\"http://www.uiaccess.com/transcripts/transcripts_on_the_web.html\">Transcripts on the Web: Getting people to your podcasts and videos</a>\n</li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-alternative-for-time-based-media\">alternative for time-based media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">document including correctly sequenced text descriptions of time-based visual and\n                           auditory information and providing a means for achieving the outcomes of any time-based\n                           interaction\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A screenplay used to create the synchronized media content would meet this definition\n                              only if it was corrected to accurately represent the final synchronized media after\n                              editing.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio\">audio</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of sound reproduction</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio can be created synthetically (including speech synthesis), recorded from real\n                              world sounds, or both.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio-only\">audio-only</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a time-based presentation that contains only <a href=\"#dfn-audio\">audio</a> (no <a href=\"#dfn-video\">video</a> and no interaction)\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-live\">live</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information captured from a real-world event and transmitted to the receiver with\n                           no more than a broadcast delay\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A broadcast delay is a short (usually automated) delay, for example used in order\n                              to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient\n                              to allow significant editing.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>If information is completely computer generated, it is not live.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-media-alternative-for-text\">media alternative for text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">media that presents no more information than is already presented in text (directly\n                           or via text alternatives)\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A media alternative for text is provided for those who benefit from alternate representations\n                              of text. Media alternatives for text may be audio-only, video-only (including sign-language\n                              video), or audio-video.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-prerecorded\">prerecorded</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information that is not <a href=\"#dfn-live\">live</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-video\">video</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of moving or sequenced pictures or images</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Video can be made up of animated or photographic images, or both.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-video-only\">video-only</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a time-based presentation that contains only <a href=\"#dfn-video\">video</a> (no <a href=\"#dfn-audio\">audio</a> and no interaction)\n                           \n                        </p>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/e7aa44/proposed/\">Audio element content has text alternative</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/f51b46/proposed/\">Video element auditory content has captions</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/c3232f/proposed/\">Video element visual-only content has accessible alternative</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>For <a href=\"#dfn-prerecorded\">prerecorded</a>\n<a href=\"#dfn-audio-only\">audio-only</a> and prerecorded <a href=\"#dfn-video-only\">video-only</a> media, the following are true, except when the audio or video is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> and is clearly labeled as such:\n                     \n                  </p>\n<dl>\n<dt>Prerecorded Audio-only</dt>\n<dd>\n<p>An <a href=\"#dfn-alternative-for-time-based-media\">alternative for time-based media</a> is provided that presents equivalent information for prerecorded audio-only content.\n                           \n                        </p>\n</dd>\n<dt>Prerecorded Video-only</dt>\n<dd>\n<p>Either an alternative for time-based media or an audio track is provided that presents\n                           equivalent information for prerecorded video-only content.\n                           \n                        </p>\n</dd>\n</dl>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G158",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G159",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G166",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F30",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F67"
        ]
    },
    {
        "rule": "wcag:1.1.1",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Non-text information is available to more people.</dd>\n<dt>What to do</dt>\n<dd>Create a text alternative for visual and auditory content.</dd>\n<dt>Why it's important</dt>\n<dd>People who can’t fully see or hear content can understand it.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to make information conveyed by non-text content\n                  accessible through the use of a text alternative.  Text alternatives are a primary\n                  way for making information accessible because they can be rendered through any sensory\n                  modality (for example, visual, auditory or tactile) to match the needs of the user.\n                  Providing text alternatives allows the information to be rendered in a variety of\n                  ways by a variety of user agents. For example, a person who cannot see a picture can\n                  have the text alternative read aloud using synthesized speech. A person who cannot\n                  hear an audio file can have the text alternative displayed so that he or she can read\n                  it. In the future, text alternatives will also allow information to be more easily\n                  translated into sign language or into a simpler form of the same language.\n                  \n               </p>\n<section id=\"-note-on-captcha-\">\n<h3>\n                     Note on CAPTCHA\n                     \n                     \n                  </h3>\n<p>\n                     CAPTCHAs are a controversial topic in the accessibility community. As is described\n                     in the\n                     paper \n                     <a href=\"https://www.w3.org/TR/turingtest/\">Inaccessibility of CAPTCHA</a>, CAPTCHAs intrinsically push the edges of human abilities in an attempt to defeat\n                     automated processes. Every type of CAPTCHA will be unsolvable by users with certain\n                     disabilities. However, they are widely used, and the Web Content Accessibility Guidelines\n                     Working Group believes that if CAPTCHAs were forbidden outright, Web sites would choose\n                     not to conform to WCAG rather than abandon CAPTCHA. This would create barriers for\n                     a great many more users with disabilities. For this reason the Working Group has chosen\n                     to structure the requirement about CAPTCHA in a way that meets the needs of most people\n                     with disabilities, yet is also considered adoptable by sites. Requiring two different\n                     forms of CAPTCHA on a given site ensures that most people with disabilities will find\n                     a form they can use.\n                     \n                  </p>\n<p>Because some users with disabilities will still not be able to access sites that meet\n                     the minimum requirements, the Working Group provides recommendations for additional\n                     steps. Organizations motivated to conform to WCAG should be aware of the importance\n                     of this topic and should go as far beyond the minimum requirements of the guidelines\n                     as possible. Additional recommended steps include:\n                     \n                  </p>\n<ul>\n<li>Providing more than two modalities of CAPTCHAs</li>\n<li>Providing access to a human customer service representative who can bypass CAPTCHA</li>\n<li>Not requiring CAPTCHAs for authorized users</li>\n</ul>\n</section>\n<section id=\"additional-information\">\n<h3>Additional information</h3>\n<p>Non-text content can take a number of forms, and this Success Criterion specifies\n                     how each is to be handled.\n                     \n                  </p>\n<p>\n<strong>\n                        For non-text content that is not covered by one of the other situations listed below,\n                        </strong>\n                     such as charts, diagrams, audio recordings, pictures, and animations, text alternatives\n                     can make the same information available in a form that can be rendered through any\n                     modality (for example, visual, auditory or tactile).  Short and long text alternatives\n                     can be used as needed to convey the information in the non-text content.  Note that\n                     \n                     <strong>\n                        prerecorded\n                        audio-only\n                        </strong> and \n                     \n                     <strong> prerecorded\n                        video-only\n                        </strong> files are covered here.  \n                     <strong>\n                        Live-audio-only\n                        </strong> and \n                     <strong>\n                        Live-video-only\n                        </strong> files are covered below (see 3rd paragraph following this one).  \n                     \n                  </p>\n<p>\n<strong>\n                        For non-text content that is a control or accepts user input\n                        </strong>, such as images used as submit buttons, image maps or complex animations, a name\n                     is provided to describe the purpose of the non-text content so that the person at\n                     least knows what the non-text content is and why it is there.\n                     \n                  </p>\n<p>\n<strong>\n                        Non-text content that is time-based media\n                        </strong>\n                     is made accessible through \n                     <a href=\"time-based-media\">1.2: Time-Based Media</a>.  However, it is important that users know what it is when they encounter it on a\n                     page so they can decide what action if any they want to take with it.  A text alternative\n                     that describes the time-based media and/or gives its title is therefore provided.\n                     \n                     \n                  </p>\n<p>\n<strong>\n                        For Live Audio-only and live video-only content\n                        </strong>, it can be much more difficult to provide text alternatives that provide equivalent\n                     information as live audio-only and live video-only content. For these types of non-text\n                     content, text alternatives provide a descriptive label.  \n                     \n                     \n                  </p>\n<p>\n<strong>\n                        Sometimes a test or exercise must be partially or completely presented in non-text\n                        format.\n                        </strong>  Audio or visual information is provided that cannot be changed to text because the\n                     test or exercise must be conducted using that sense.  For example, a hearing test\n                     would be invalid if a text alternative were provided.  A visual skill development\n                     exercise would similarly make no sense in text form.  And a spelling test with text\n                     alternatives would not be very effective.  For these cases, text alternatives should\n                     be provided to describe the purpose of the non-text content; of course, the text alternatives\n                     would not provide the same information needed to pass the test. \n                     \n                  </p>\n<p>\n<strong>\n                        Sometimes content is primarily intended to create a specific sensory experience\n                        </strong> that words cannot fully capture. Examples include a symphony performance, works of\n                     visual art etc. For such content, text alternatives at least identify the non-text\n                     content with a descriptive label and where possible, additional descriptive text.\n                     If the reason for including the content in the page is known and can be described\n                     it is helpful to include that information. \n                     \n                  </p>\n<p>\n<strong>Sometimes there are non-text exercises that are used to prove you are human.</strong> To avoid spam robots and other software from gaining access to a site a device called\n                     a CAPTCHA is used. These usually involve visual or auditory tasks that are beyond\n                     the current capabilities of Web robots. Providing a text alternative to them would\n                     however make them operable by Robots, thus defeating their purpose. In this case a\n                     text alternative would describe the purpose of the CAPTCHA, and alternate forms using\n                     different modalities would be provided to address the needs of people with different\n                     disabilities.\n                     \n                  </p>\n<p>\n<strong>\n                        Sometimes there is non-text content that really is not meant to be seen or understood\n                        by the user.\n                        </strong> Transparent images used to move text over on a page; an invisible image that is used\n                     to track usage statistics; and a swirl in the corner that conveys no information but\n                     just fills up a blank space to create an aesthetic effect are all examples of this.\n                     Putting alternative text on such items just distracts people using screen readers\n                     from the content on the page. Not marking the content in any way, though, leaves users\n                     guessing what the non-text content is and what information they may have missed (even\n                     though they have not missed anything in reality). This type of non-text content, therefore,\n                     is marked or implemented in a way that assistive technologies (AT) will ignore it\n                     and not present anything to the user.\n                     \n                  </p>\n</section>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>This Success Criterion helps people who have difficulty perceiving visual content.\n                     Assistive technology can read text aloud, present it visually, or convert it to braille.\n                     \n                  </li>\n<li>Text alternatives may help some people who have difficulty understanding the meaning\n                     of photographs, drawings, and other images  (e.g., line drawings, graphic designs,\n                     paintings, three-dimensional representations), graphs, charts, animations, etc.\n                     \n                     \n                  </li>\n<li>\n                     People who are deaf, are hard of hearing, or who are having trouble understanding\n                     audio information for any reason can read the text presentation. Research is ongoing\n                     regarding automatic translation of text into sign language. \n                     \n                     \n                  </li>\n<li>\n                     People who are deaf-blind can read the text in braille.\n                     \n                     \n                  </li>\n<li>\n                     Additionally, text alternatives support the ability to search for non-text content\n                     and to repurpose content in a variety of ways.\n                     \n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>A data chart</dt>\n<dd>A bar chart compares how many widgets were sold in June, July, and August. The short\n                     label says, \"Figure one - Sales in June, July and August.\" The longer description\n                     identifies the type of chart, provides a high-level summary of the data, trends and\n                     implications comparable to those available from the chart. Where possible and practical,\n                     the actual data is provided in a table.\n                  </dd>\n<dt>An audio recording of a speech</dt>\n<dd>The link to an audio clip says, \"Chairman's speech to the assembly.\" A link to a text\n                     transcript is provided immediately after the link to the audio clip.\n                  </dd>\n<dt>An animation that illustrates how a car engine works</dt>\n<dd>An animation shows how a car engine works. There is no audio and the animation is\n                     part of a tutorial that describes how an engine works. Since the text of the tutorial\n                     already provides a full explanation, the image is an alternative for text and the\n                     text alternative includes only a brief description of the animation and refers to\n                     the tutorial text for more information.\n                  </dd>\n<dt>A traffic Web camera</dt>\n<dd>A Web site allows users to select from a variety of Web cameras positioned throughout\n                     a major city. After a camera is selected, the image updates every two minutes. A short\n                     text alternative identifies the Web camera as \"traffic Web camera.\" The site also\n                     provides a table of travel times for each of the routes covered by the Web cameras.\n                     The table is also updated every two minutes.\n                  </dd>\n<dt>A photograph of an historic event in a news story</dt>\n<dd>A photograph of two world leaders shaking hands accompanies a news story about an\n                     international summit meeting. The text alternative says, \"President X of Country X\n                     shakes hands with Prime Minister Y of country Y.\"\n                  </dd>\n<dt>A photograph of a historic event in content discussing diplomatic relationships</dt>\n<dd>The same image is used in a different context intended to explain nuances in diplomatic\n                     encounters. The image of the president shaking hands with the prime minister appears\n                     on a Web site discussing intricate diplomatic relationships. The first text alternative\n                     reads, \"President X of country X shakes hands with Prime Minister Y of country Y on\n                     January 2, 2009.\" An additional text alternative describes the room where the leaders\n                     are standing as well as the expressions on the leaders' faces, and identifies the\n                     other people in the room. The additional description might be included on the same\n                     page as the photograph or in a separate file associated with the image through a link\n                     or other standard programmatic mechanism.\n                  </dd>\n<dt>An audio recording of a press conference </dt>\n<dd>A Web page includes a link to an audio recording of a press conference. The link text\n                     identifies the audio recording. The page also links to a text transcript of the press\n                     conference. The transcript includes a verbatim record of everything the speakers say.\n                     It identifies who is speaking as well as noting other significant sounds that are\n                     part of the recording, such as applause, laughter, questions from the audience, and\n                     so on.\n                  </dd>\n<dt>An e-learning application</dt>\n<dd>An e-learning application uses sound effects to indicate whether or not the answers\n                     are correct. The chime sound indicates that the answer is correct and the beep sound\n                     indicates that the answer is incorrect. A text description is also included so that\n                     people who can't hear or understand the sound understand whether the answer is correct\n                     or incorrect.\n                  </dd>\n<dt>A linked thumbnail image</dt>\n<dd>A thumbnail image of the front page of a newspaper links to the home page of the \"Smallville\n                     Times\". The text alternative says \"Smallville Times\".\n                  </dd>\n<dt>The same image used on different sites</dt>\n<dd>Different alternatives for an image of the world: An image of the world that is used\n                     on a travel site as a link to the International Travel section has the text alternative\n                     \"International Travel\". The same image is used as a link on a university Web site\n                     with the text alternative \"International Campuses\".\n                  </dd>\n<dt>An image map</dt>\n<dd>An image of a building floor plan is interactive, allowing the user to select a\n                     particular room and navigate to a page containing information about that room.\n                     The short text alternative describes the image and its interactive purpose:\n                     \"Building floor plan. Select a room for more information.\"\n                  </dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>\n<a href=\"https://www.w3.org/2000/08/nba-manual/Overview.html\">Excerpts from the NBA Tape Recording Manual, Third Edition</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/turingtest/\">Inaccessibility of CAPTCHA</a>\n</li>\n<li>\n<a href=\"https://stuffandnonsense.co.uk/archives/accessible_alternatives.html\">All That Malarkey: Accessible Alternatives</a>\n</li>\n<li>\n<a href=\"http://www.456bereastreet.com/archive/200412/the_alt_and_title_attributes/\">456 Berea Street: The Alt and Title Attributes</a>\n</li>\n<li>\n<a href=\"http://green-beast.com/blog/?p=81\">The Alt and Accessibility</a>\n</li>\n<li>\n<a href=\"http://www.accessibilitynews.ca/cwdo/resources/resources.php?resources=187\">Better Connected, Better Results: Alt Text</a>\n</li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-ascii-art\">ascii art</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">picture created by a spatial arrangement of characters or glyphs (typically from the\n                           95 printable characters defined by ASCII)\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-assistive-technology\">assistive technology</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">hardware and/or software that acts as a <a href=\"#dfn-user-agent\">user agent</a>, or along with a mainstream user agent, to provide functionality to meet the requirements\n                           of users with disabilities that go beyond those offered by mainstream user agents\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Functionality provided by assistive technology includes alternative presentations\n                              (e.g., as synthesized speech or magnified content), alternative input methods (e.g.,\n                              voice), additional navigation or orientation mechanisms, and content transformations\n                              (e.g., to make tables more accessible).\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Assistive technologies often communicate data and messages with mainstream user agents\n                              by using and monitoring APIs.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The distinction between mainstream user agents and assistive technologies is not absolute.\n                              Many mainstream user agents provide some features to assist individuals with disabilities.\n                              The basic difference is that mainstream user agents target broad and diverse audiences\n                              that usually include people with and without disabilities. Assistive technologies\n                              target narrowly defined populations of users with specific disabilities. The assistance\n                              provided by an assistive technology is more specific and appropriate to the needs\n                              of its target users. The mainstream user agent may provide important functionality\n                              to assistive technologies like retrieving Web content from program objects or parsing\n                              markup into identifiable bundles.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Assistive technologies that are important in the context of this document include\n                              the following:\n                              \n                           </p>\n<ul>\n<li>screen magnifiers, and other visual reading assistants, which are used by people with\n                                 visual, perceptual and physical print disabilities to change text font, size, spacing,\n                                 color, synchronization with speech, etc. in order to improve the visual readability\n                                 of rendered text and images;\n                                 \n                              </li>\n<li>screen readers, which are used by people who are blind to read textual information\n                                 through synthesized speech or braille;\n                                 \n                              </li>\n<li>text-to-speech software, which is used by some people with cognitive, language, and\n                                 learning disabilities to convert text into synthetic speech;\n                                 \n                              </li>\n<li>speech recognition software, which may be used by people who have some physical disabilities;</li>\n<li>alternative keyboards, which are used by people with certain physical disabilities\n                                 to simulate the keyboard (including alternate keyboards that use head pointers, single\n                                 switches, sip/puff and other special input devices.);\n                                 \n                              </li>\n<li>alternative pointing devices, which are used by people with certain physical disabilities\n                                 to simulate mouse pointing and button activations.\n                                 \n                              </li>\n</ul>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-captcha\">captcha</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">initialism for \"Completely Automated Public Turing test to tell Computers and Humans\n                           Apart\"\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>CAPTCHA tests often involve asking the user to type in text that is displayed in an\n                              obscured image or audio file.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A Turing test is any system of tests designed to differentiate a human from a computer.\n                              It is named after famed computer scientist Alan Turing. The term was coined by researchers\n                              at Carnegie Mellon University.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-content\">content</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information and sensory experience to be communicated to the user by means of a <a href=\"#dfn-user-agent\">user agent</a>, including code or markup that defines the content's <a href=\"#dfn-structure\">structure</a>, <a href=\"#dfn-presentation\">presentation</a>, and interactions\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-human-language\">human language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">language that is spoken, written or signed (through visual or tactile means) to communicate\n                           with humans\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>See also <a href=\"#dfn-sign-language\">sign language</a>.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-label\">label</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-text\">text</a> or other component with a <a href=\"#dfn-text-alternative\">text alternative</a> that is presented to a user to identify a component within Web <a href=\"#dfn-content\">content</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A label is presented to all users whereas the <a href=\"#dfn-name\">name</a> may be hidden and only exposed by assistive technology. In many (but not all) cases\n                              the name and the label are the same.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The term label is not limited to the label element in HTML.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-name\">name</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">text by which software can identify a component within Web content to the user</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The name may be hidden and only exposed by assistive technology, whereas a <a href=\"#dfn-label\">label</a> is presented to all users. In many (but not all) cases, the label and the name are\n                              the same.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This is unrelated to the name attribute in HTML.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-non-text-content\">non-text content</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any content that is not a sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a> or where the sequence is not expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This includes <a href=\"#dfn-ascii-art\">ASCII Art</a> (which is a pattern of characters), emoticons, leetspeak (which uses character substitution),\n                              and images representing text\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-presentation\">presentation</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">rendering of the <a href=\"#dfn-content\">content</a> in a form to be perceived by users\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-programmatically-determined\">programmatically determined</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">determined by software from author-supplied data provided in a way that different\n                           <a href=\"#dfn-user-agent\">user agents</a>, including <a href=\"#dfn-assistive-technology\">assistive technologies</a>, can extract and present this information to users in different modalities\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined in a markup language from elements and attributes that are accessed directly\n                              by commonly available assistive technology.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined from technology-specific data structures in a non-markup language and exposed\n                              to assistive technology via an accessibility API that is supported by commonly available\n                              assistive technology.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-pure-decoration\">pure decoration</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">serving only an aesthetic purpose, providing no information, and having no functionality</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Text is only purely decorative if the words can be rearranged or substituted without\n                              changing their purpose.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>The cover page of a dictionary has random words in very light text in the background.</p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-sign-language\">sign language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a language using combinations of movements of the hands and arms, facial expressions,\n                           or body positions to convey meaning\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-specific-sensory-experience\">specific sensory experience</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a sensory experience that is not purely decorative and does not primarily convey important\n                           information or perform a function\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Examples include a performance of a flute solo, works of visual art etc.</p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-structure\">structure</dt>\n<dd>\n<definition xmlns=\"\">\n<ol xmlns=\"http://www.w3.org/1999/xhtml\">\n<li>The way the parts of a <a href=\"#dfn-web-page\">Web page</a> are organized in relation to each other; and\n                              \n                           </li>\n<li>The way a collection of <a href=\"#dfn-web-page\">Web pages</a> is organized\n                              \n                           </li>\n</ol>\n</definition>\n</dd>\n<dt id=\"dfn-text\">text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a>, where the sequence is expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-text-alternative\">text alternative</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-text\">Text</a> that is programmatically associated with <a href=\"#dfn-non-text-content\">non-text content</a> or referred to from text that is programmatically associated with non-text content.\n                           Programmatically associated text is text whose location can be programmatically determined\n                           from the non-text content.\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>An image of a chart is described in text in the paragraph after the chart. The short\n                              text alternative for the chart indicates that a description follows.\n                              \n                           </p>\n</aside>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Refer to <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/conformance#text-alternatives\">Understanding Text Alternatives</a> for more information.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-user-agent\">user agent</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any software that retrieves and presents Web content for users</p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Web browsers, media players, plug-ins, and other programs — including <a href=\"#dfn-assistive-technology\">assistive technologies</a> — that help in retrieving, rendering, and interacting with Web content.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-web-page\">web page</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a non-embedded resource obtained from a single URI using HTTP plus any other resources\n                           that are used in the rendering or intended to be rendered together with it by a <a href=\"#dfn-user-agent\">user agent</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Although any \"other resources\" would be rendered together with the primary resource,\n                              they would not necessarily be rendered simultaneously with each other.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>For the purposes of conformance with these guidelines, a resource must be \"non-embedded\"\n                              within the scope of conformance to be considered a Web page.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A Web resource including all embedded images and media.</p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program\n                              lives entirely at http://example.com/mail, but includes an inbox, a contacts area\n                              and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar\n                              to display, but do not change the URI of the page as a whole.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A customizable portal site, where users can choose content to display from a set of\n                              different content modules.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like\n                              interactive shopping environment where you visually move around in a store dragging\n                              products off of the shelves around you and into a visual shopping cart in front of\n                              you. Clicking on a product causes it to be demonstrated with a specification sheet\n                              floating alongside. This might be a single-page Web site or just one page within a\n                              Web site.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/qt1vmo/\">Image accessible name is descriptive</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/59796f/\">Image button has non-empty accessible name</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/23a2a8/\">Image has non-empty accessible name</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/c487ae/\">Link has non-empty accessible name</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/8fc3b6/\">Object element rendering non-text content has non-empty accessible name</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/7d6734/\">SVG element with explicit role has non-empty accessible name</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/9eb3f6/proposed/\">Image filename is accessible name for image</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/e88epe/proposed/\">Image not in the accessibility tree is decorative</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>All <a href=\"#dfn-non-text-content\">non-text content</a> that is presented to the user has a <a href=\"#dfn-text-alternative\">text alternative</a> that serves the equivalent purpose, except for the situations listed below.\n                     \n                  </p>\n<dl>\n<dt>Controls, Input</dt>\n<dd>\n<p>If non-text content is a control or accepts user input, then it has a <a href=\"#dfn-name\">name</a> that describes its purpose. (Refer to <a href=\"#name-role-value\">Success Criterion 4.1.2</a> for additional requirements for controls and content that accepts user input.)\n                           \n                        </p>\n</dd>\n<dt>Time-Based Media</dt>\n<dd>\n<p>If non-text content is time-based media, then text alternatives at least provide descriptive\n                           identification of the non-text content. (Refer to <a href=\"#time-based-media\">Guideline 1.2</a> for additional requirements for media.)\n                           \n                        </p>\n</dd>\n<dt>Test</dt>\n<dd>\n<p>If non-text content is a test or exercise that would be invalid if presented in <a href=\"#dfn-text\">text</a>, then text alternatives at least provide descriptive identification of the non-text\n                           content.\n                           \n                        </p>\n</dd>\n<dt>Sensory</dt>\n<dd>\n<p>If non-text content is primarily intended to create a <a href=\"#dfn-specific-sensory-experience\">specific sensory experience</a>, then text alternatives at least provide descriptive identification of the non-text\n                           content.\n                           \n                        </p>\n</dd>\n<dt>\n<a href=\"#dfn-captcha\">CAPTCHA</a>\n</dt>\n<dd>\n<p>If the purpose of non-text content is to confirm that content is being accessed by\n                           a person rather than a computer, then text alternatives that identify and describe\n                           the purpose of the non-text content are provided, and alternative forms of CAPTCHA\n                           using output modes for different types of sensory perception are provided to accommodate\n                           different disabilities.\n                           \n                        </p>\n</dd>\n<dt>Decoration, Formatting, Invisible</dt>\n<dd>\n<p>If non-text content is <a href=\"#dfn-pure-decoration\">pure decoration</a>, is used only for visual formatting, or is not presented to users, then it is implemented\n                           in a way that it can be ignored by <a href=\"#dfn-assistive-technology\">assistive technology</a>.\n                           \n                        </p>\n</dd>\n</dl>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G94",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G95",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques//H35",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA15",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G73",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G74",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G92",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G82",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA9",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H24",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H30",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H36",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H44",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H65",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G68",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G100",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G143",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G144",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C9",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H67",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF4",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C18",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F3",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F13",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F20",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F30",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F38",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F39",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F65",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F67",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F71",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F72"
        ]
    },
    {
        "rule": "wcag:1.2.2",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Videos can be played with captions.</dd>\n<dt>What to do</dt>\n<dd>Provide synchronized text for audio content in existing videos.</dd>\n<dt>Why it's important</dt>\n<dd>People who are deaf or hard of hearing can understand audio in videos.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to enable people who are deaf or hard of hearing\n                  to watch synchronized media presentations. Captions provide the part of the content\n                  available via the audio track. Captions not only include dialogue, but identify who\n                  is speaking and include non-speech information conveyed through sound, including meaningful\n                  sound effects. \n                  \n               </p>\n<p>It is acknowledged that at the present time there may be difficulty in creating captions\n                  for time-sensitive material and this may result in the author being faced with the\n                  choice of delaying the information until captions are available, or publishing time-sensitive\n                  content that is inaccessible to the deaf, at least for the interval until captions\n                  are available. Over time, the tools for captioning as well as building the captioning\n                  into the delivery process can shorten or eliminate such delays.\n                  \n                  \n               </p>\n<p>Captions are not needed when the synchronized media is, itself, an alternate presentation\n                  of information that is also presented via text on the Web page. For example, if information\n                  on a page is accompanied by a synchronized media presentation that presents no more\n                  information than is already presented in text, but is easier for people with cognitive,\n                  language, or learning disabilities to understand, then it would not need to be captioned\n                  since the information is already presented on the page in text or in text alternatives\n                  (e.g., for images). \n                  \n                  \n               </p>\n<p>See also \n                  <a href=\"captions-live\">1.2.4: Captions (Live)</a>.\n                  \n               </p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li> People who are deaf or have a hearing loss can access the auditory information in\n                     the synchronized media content through captions.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<ul>\n<li>\n<p><strong>A captioned tutorial</strong></p>\n<p>A video clip shows how to tie a knot. The captions read, </p>\n<p>\"(music) </p>\n<p>Using rope to tie knots was an important skill</p>\n<p>for the likes of sailors, soldiers and woodsmen..\" </p>\n<p>From Sample Transcript Formatting by Whit Anderson.</p>\n</li>\n<li>A complex legal document contains synchronized media clips for different paragraphs\n                     that show a person speaking the contents of the paragraph. Each clip is associated\n                     with its corresponding paragraph. No captions are provided for the synchronized media.\n                  </li>\n<li>An instruction manual containing a description of a part and its necessary orientation\n                     is accompanied by a synchronized media clip showing the part in its correct orientation.\n                     No captions are provided for the synchronized media clip.\n                  </li>\n<li>\n<p>An orchestra provides captions for videos of performances. In addition to capturing\n                        dialog and lyrics verbatim, captions identify non-vocal music by title, movement,\n                        composer, and any information that will help the user comprehend the nature of the\n                        audio. For instance captions read,\n                     </p>\n<p>\"[Orchestral Suite No. 3.2 in D major, BWV 1068, Air]</p>\n<p>[Johann Sebastian Bach, Composer] </p>\n<p>♪ Calm melody with a slow tempo ♪\"</p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<div>\n<p>Style guides for captions may differ among different languages.</p>\n</div>\n</div>\n</li>\n</ul>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<section id=\"guides-to-captioning\">\n<h3>Guides to Captioning</h3>\n<ul>\n<li>\n<a href=\"https://www.bbc.co.uk/accessibility/forproducts/guides/subtitles/\">BBC: Subtitle Guidelines</a>\n</li>\n<li>\n<a href=\"https://dcmp.org/learn/captioningkey\">Captioning Key: Guidelines and Preferred Techniques</a>\n</li>\n<li>\n<a href=\"https://joeclark.org/access/captioning/bpoc/\">Best Practices in Online Captioning</a>\n</li>\n</ul>\n</section>\n<section id=\"smil-resources\">\n<h3>SMIL Resources</h3>\n<ul>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL/\">Synchronized Multimedia Integration Language (SMIL) 3.0</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL-access/\">Accessibility Features of SMIL</a>\n</li>\n</ul>\n</section>\n<section id=\"other-captioning-resources\">\n<h3>Other Captioning Resources</h3>\n<ul>\n<li>\n<a href=\"https://www.wgbh.org/foundation/what-we-do/ncam\">National Center for Accessible Media</a>\n</li>\n<li>\n<a href=\"https://webaim.org/techniques/captions/\">WebAIM: Captioning Resource List</a>\n</li>\n</ul>\n</section>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-ascii-art\">ascii art</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">picture created by a spatial arrangement of characters or glyphs (typically from the\n                           95 printable characters defined by ASCII)\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-assistive-technology\">assistive technology</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">hardware and/or software that acts as a <a href=\"#dfn-user-agent\">user agent</a>, or along with a mainstream user agent, to provide functionality to meet the requirements\n                           of users with disabilities that go beyond those offered by mainstream user agents\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Functionality provided by assistive technology includes alternative presentations\n                              (e.g., as synthesized speech or magnified content), alternative input methods (e.g.,\n                              voice), additional navigation or orientation mechanisms, and content transformations\n                              (e.g., to make tables more accessible).\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Assistive technologies often communicate data and messages with mainstream user agents\n                              by using and monitoring APIs.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The distinction between mainstream user agents and assistive technologies is not absolute.\n                              Many mainstream user agents provide some features to assist individuals with disabilities.\n                              The basic difference is that mainstream user agents target broad and diverse audiences\n                              that usually include people with and without disabilities. Assistive technologies\n                              target narrowly defined populations of users with specific disabilities. The assistance\n                              provided by an assistive technology is more specific and appropriate to the needs\n                              of its target users. The mainstream user agent may provide important functionality\n                              to assistive technologies like retrieving Web content from program objects or parsing\n                              markup into identifiable bundles.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Assistive technologies that are important in the context of this document include\n                              the following:\n                              \n                           </p>\n<ul>\n<li>screen magnifiers, and other visual reading assistants, which are used by people with\n                                 visual, perceptual and physical print disabilities to change text font, size, spacing,\n                                 color, synchronization with speech, etc. in order to improve the visual readability\n                                 of rendered text and images;\n                                 \n                              </li>\n<li>screen readers, which are used by people who are blind to read textual information\n                                 through synthesized speech or braille;\n                                 \n                              </li>\n<li>text-to-speech software, which is used by some people with cognitive, language, and\n                                 learning disabilities to convert text into synthetic speech;\n                                 \n                              </li>\n<li>speech recognition software, which may be used by people who have some physical disabilities;</li>\n<li>alternative keyboards, which are used by people with certain physical disabilities\n                                 to simulate the keyboard (including alternate keyboards that use head pointers, single\n                                 switches, sip/puff and other special input devices.);\n                                 \n                              </li>\n<li>alternative pointing devices, which are used by people with certain physical disabilities\n                                 to simulate mouse pointing and button activations.\n                                 \n                              </li>\n</ul>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-audio\">audio</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of sound reproduction</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio can be created synthetically (including speech synthesis), recorded from real\n                              world sounds, or both.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio-description\">audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">narration added to the soundtrack to describe important visual details that cannot\n                           be understood from the main soundtrack alone\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio description of <a href=\"#dfn-video\">video</a> provides information about actions, characters, scene changes, on-screen text, and\n                              other visual content.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In standard audio description, narration is added during existing pauses in dialogue.\n                              (See also <a href=\"#dfn-extended-audio-description\">extended audio description</a>.)\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Where all of the <a href=\"#dfn-video\">video</a> information is already provided in existing <a href=\"#dfn-audio\">audio</a>, no additional audio description is necessary.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Also called \"video description\" and \"descriptive narration.\"</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-captions\">captions</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">synchronized visual and/or <a href=\"#dfn-text-alternative\">text alternative</a> for both speech and non-speech audio information needed to understand the media content\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Captions are similar to dialogue-only subtitles except captions convey not only the\n                              content of spoken dialogue, but also equivalents for non-dialogue audio information\n                              needed to understand the program content, including sound effects, music, laughter,\n                              speaker identification and location.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Closed Captions are equivalents that can be turned on and off with some players.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Open Captions are any captions that cannot be turned off. For example, if the captions\n                              are visual equivalent <a href=\"#dfn-image-of-text\">images of text</a> embedded in <a href=\"#dfn-video\">video</a>.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Captions should not obscure or obstruct relevant information in the video.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In some countries, captions are called subtitles.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>\n<a href=\"#dfn-audio-description\">Audio descriptions</a> can be, but do not need to be, captioned since they are descriptions of information\n                              that is already presented visually.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-extended-audio-description\">extended audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">audio description that is added to an audiovisual presentation by pausing the <a href=\"#dfn-video\">video</a> so that there is time to add additional description\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This technique is only used when the sense of the <a href=\"#dfn-video\">video</a> would be lost without the additional <a href=\"#dfn-audio-description\">audio description</a> and the pauses between dialogue/narration are too short.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-human-language\">human language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">language that is spoken, written or signed (through visual or tactile means) to communicate\n                           with humans\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>See also <a href=\"#dfn-sign-language\">sign language</a>.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-image-of-text\">image of text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">text that has been rendered in a non-text form (e.g., an image) in order to achieve\n                           a particular visual effect\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This does not include <a href=\"#dfn-text\">text</a> that is part of a picture that contains significant other visual content.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A person's name on a nametag in a photograph.</p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-live\">live</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information captured from a real-world event and transmitted to the receiver with\n                           no more than a broadcast delay\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A broadcast delay is a short (usually automated) delay, for example used in order\n                              to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient\n                              to allow significant editing.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>If information is completely computer generated, it is not live.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-media-alternative-for-text\">media alternative for text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">media that presents no more information than is already presented in text (directly\n                           or via text alternatives)\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A media alternative for text is provided for those who benefit from alternate representations\n                              of text. Media alternatives for text may be audio-only, video-only (including sign-language\n                              video), or audio-video.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-non-text-content\">non-text content</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any content that is not a sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a> or where the sequence is not expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This includes <a href=\"#dfn-ascii-art\">ASCII Art</a> (which is a pattern of characters), emoticons, leetspeak (which uses character substitution),\n                              and images representing text\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-prerecorded\">prerecorded</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information that is not <a href=\"#dfn-live\">live</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-programmatically-determined\">programmatically determined</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">determined by software from author-supplied data provided in a way that different\n                           <a href=\"#dfn-user-agent\">user agents</a>, including <a href=\"#dfn-assistive-technology\">assistive technologies</a>, can extract and present this information to users in different modalities\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined in a markup language from elements and attributes that are accessed directly\n                              by commonly available assistive technology.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined from technology-specific data structures in a non-markup language and exposed\n                              to assistive technology via an accessibility API that is supported by commonly available\n                              assistive technology.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-sign-language\">sign language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a language using combinations of movements of the hands and arms, facial expressions,\n                           or body positions to convey meaning\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-synchronized-media\">synchronized media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-audio\">audio</a> or <a href=\"#dfn-video\">video</a> synchronized with another format for presenting information and/or with time-based\n                           interactive components, unless the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> that is clearly labeled as such\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-text\">text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a>, where the sequence is expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-text-alternative\">text alternative</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-text\">Text</a> that is programmatically associated with <a href=\"#dfn-non-text-content\">non-text content</a> or referred to from text that is programmatically associated with non-text content.\n                           Programmatically associated text is text whose location can be programmatically determined\n                           from the non-text content.\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>An image of a chart is described in text in the paragraph after the chart. The short\n                              text alternative for the chart indicates that a description follows.\n                              \n                           </p>\n</aside>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Refer to <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/conformance#text-alternatives\">Understanding Text Alternatives</a> for more information.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-user-agent\">user agent</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any software that retrieves and presents Web content for users</p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Web browsers, media players, plug-ins, and other programs — including <a href=\"#dfn-assistive-technology\">assistive technologies</a> — that help in retrieving, rendering, and interacting with Web content.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-video\">video</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of moving or sequenced pictures or images</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Video can be made up of animated or photographic images, or both.</p>\n</div>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/eac66b/proposed/\">Video element auditory content has accessible alternative</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>\n<a href=\"#dfn-captions\">Captions</a> are provided for all <a href=\"#dfn-prerecorded\">prerecorded</a>\n<a href=\"#dfn-audio\">audio</a> content in <a href=\"#dfn-synchronized-media\">synchronized media</a>, except when the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> and is clearly labeled as such.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G93",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM11",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM12",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H95",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F8",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F75",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F74"
        ]
    },
    {
        "rule": "wcag:1.2.3",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Prerecorded videos can be understood by more people.</dd>\n<dt>What to do</dt>\n<dd>Provide a description of the visual content in videos.</dd>\n<dt>Why it's important</dt>\n<dd>People who are blind or who cannot understand the visual content can have it described.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to provide people who are blind or visually\n                  impaired access to the visual information in a synchronized media presentation. This\n                  Success Criterion describes two approaches, either of which can be used.\n                  \n               </p>\n<p>One approach is to provide audio description of the video content. The audio description\n                  augments the audio portion of the presentation with the information needed when the\n                  video portion is not available. During existing pauses in dialogue, audio description\n                  provides information about actions, characters, scene changes, and on-screen text\n                  that  are important and are not described or spoken in the main sound track.\n                  \n               </p>\n<p>The second approach involves providing all of the information in the synchronized\n                  media (both visual and auditory) in text form. An alternative for time-based media\n                  provides a running description of all that is going on in the synchronized media content.\n                  The alternative for time-based media reads something like a screenplay or book. Unlike\n                  audio description, the description of the video portion is not constrained to just\n                  the pauses in the existing dialogue. Full descriptions are provided of all visual\n                  information, including visual context, actions and expressions of actors, and any\n                  other visual material. In addition, non-speech sounds (laughter, off-screen voices,\n                  etc.) are described, and transcripts of all dialogue are included. The sequence of\n                  description and dialogue transcripts are the same as the sequence in the synchronized\n                  media itself. As a result, the alternative for time-based media can provide a much\n                  more complete representation of the synchronized media content than audio description\n                  alone.\n                  \n               </p>\n<p>If there is any interaction as part of the synchronized media presentation (e.g.,\n                  \"press now to answer the question\") then the alternative for time-based media would\n                  provide hyperlinks or whatever is needed to provide the same functionality.\n                  \n               </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<div>\n<p>\n                        For 1.2.3, 1.2.5, and 1.2.7, if all of the information in the video track is already\n                        provided in the audio track, no audio description is necessary. \n                        \n                        \n                        \n                     </p>\n<p>\n                        1.2.3, 1.2.5, and 1.2.8 overlap somewhat with each other. This is to give the author\n                        some choice at the minimum conformance level, and to provide additional requirements\n                        at higher levels. At Level A in Success Criterion 1.2.3, authors do have the choice\n                        of providing either an audio description or a full text alternative. If they wish\n                        to conform at Level AA, under Success Criterion 1.2.5 authors must provide an audio\n                        description - a requirement already met if they chose that alternative for 1.2.3,\n                        otherwise an additional requirement. At Level AAA under Success Criterion 1.2.8 they\n                        must provide an extended text description. This is an additional requirement if both\n                        1.2.3 and 1.2.5 were met by providing an audio description only. If 1.2.3 was met,\n                        however, by providing a text description, and the 1.2.5 requirement for an audio description\n                        was met, then 1.2.8 does not add new requirements.\n                        \n                     </p>\n</div>\n</div>\n<p>See also\n                  <a href=\"audio-description-prerecorded\">1.2.5 Audio Description (Prerecorded)</a>,\n                  <a href=\"extended-audio-description-prerecorded\">1.2.7 Extended Audio Description (Prerecorded)</a> and\n                  <a href=\"media-alternative-prerecorded\">1.2.8 Media Alternative (Prerecorded)</a>.\n                  \n               </p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>This Success Criterion may help some people who have difficulty watching video or\n                     other synchronized media content, including people who have difficulty perceiving\n                     or understanding moving images.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>A movie with audio description</dt>\n<dd>\n<p>\n<strong>Describer: </strong>A title, \"Teaching Evolution Case Studies. Bonnie Chen.\" A teacher shows photographs\n                        of birds with long, thin beaks.\n                        \n                     </p>\n<p>\n<strong>Bonnie Chen: </strong>\"These photos were all taken at the Everglades.\"\n                        \n                     </p>\n<p>\n<strong>Describer: </strong>The teacher hands each student two flat, thin wooden sticks.\n                        \n                     </p>\n<p>\n<strong>Bonnie Chen: </strong>\"Today you will pretend to be a species of wading bird that has a beak like this.\"\n                        \n                     </p>\n<p>\n<strong>Describer: </strong>The teacher holds two of the sticks to her mouth making the shape of a beak.\n                        \n                     </p>\n<p>Transcript of audio based on the first few minutes of \"<a href=\"https://www.pbs.org/wgbh/evolution/educators/teachstuds/tvideos.html\">Teaching Evolution Case Studies, Bonnie Chen</a>\" (copyright WGBH and Clear Blue Sky Productions, Inc.)\n                     </p>\n</dd>\n<dt>An alternative for time-based media for a training video</dt>\n<dd>A company purchases a Training video for use by its employees and puts it on the companies\n                     intranet. The video involves explaining use of a new technology and has a person talking\n                     and showing things at the same time. Since there is no place to insert audio description\n                     of the visual demonstrations during gaps in dialogue, the company provides an alternative\n                     for time-based media that all employees, including those who cannot see the demonstrations,\n                     can use to better understand what is being presented.\n                  </dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>\n<a href=\"http://ncam.wgbh.org/invent_build/web_multimedia/accessible-digital-media-guide/guideline-h-multimedia#techH12\">NCAM Rich Media Accessibility, Accessible SMIL Templates</a>\n</li>\n<li>\n<a href=\"http://joeclark.org/access/description/ad-principles.html\">Standard Techniques in Audio Description</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/REC-smil/\">Synchronized Multimedia Integration Language (SMIL) 1.0</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL/\">Synchronized Multimedia Integration Language (SMIL 2.0)</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL-access/\">Accessibility Features of SMIL</a>\n</li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-alternative-for-time-based-media\">alternative for time-based media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">document including correctly sequenced text descriptions of time-based visual and\n                           auditory information and providing a means for achieving the outcomes of any time-based\n                           interaction\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A screenplay used to create the synchronized media content would meet this definition\n                              only if it was corrected to accurately represent the final synchronized media after\n                              editing.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio\">audio</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of sound reproduction</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio can be created synthetically (including speech synthesis), recorded from real\n                              world sounds, or both.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio-description\">audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">narration added to the soundtrack to describe important visual details that cannot\n                           be understood from the main soundtrack alone\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio description of <a href=\"#dfn-video\">video</a> provides information about actions, characters, scene changes, on-screen text, and\n                              other visual content.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In standard audio description, narration is added during existing pauses in dialogue.\n                              (See also <a href=\"#dfn-extended-audio-description\">extended audio description</a>.)\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Where all of the <a href=\"#dfn-video\">video</a> information is already provided in existing <a href=\"#dfn-audio\">audio</a>, no additional audio description is necessary.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Also called \"video description\" and \"descriptive narration.\"</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-extended-audio-description\">extended audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">audio description that is added to an audiovisual presentation by pausing the <a href=\"#dfn-video\">video</a> so that there is time to add additional description\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This technique is only used when the sense of the <a href=\"#dfn-video\">video</a> would be lost without the additional <a href=\"#dfn-audio-description\">audio description</a> and the pauses between dialogue/narration are too short.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-live\">live</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information captured from a real-world event and transmitted to the receiver with\n                           no more than a broadcast delay\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A broadcast delay is a short (usually automated) delay, for example used in order\n                              to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient\n                              to allow significant editing.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>If information is completely computer generated, it is not live.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-media-alternative-for-text\">media alternative for text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">media that presents no more information than is already presented in text (directly\n                           or via text alternatives)\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A media alternative for text is provided for those who benefit from alternate representations\n                              of text. Media alternatives for text may be audio-only, video-only (including sign-language\n                              video), or audio-video.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-prerecorded\">prerecorded</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information that is not <a href=\"#dfn-live\">live</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-synchronized-media\">synchronized media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-audio\">audio</a> or <a href=\"#dfn-video\">video</a> synchronized with another format for presenting information and/or with time-based\n                           interactive components, unless the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> that is clearly labeled as such\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-video\">video</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of moving or sequenced pictures or images</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Video can be made up of animated or photographic images, or both.</p>\n</div>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/c5a4ea/proposed/\">Video element visual content has accessible alternative</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>An <a href=\"#dfn-alternative-for-time-based-media\">alternative for time-based media</a> or <a href=\"#dfn-audio-description\">audio description</a> of the <a href=\"#dfn-prerecorded\">prerecorded</a>\n<a href=\"#dfn-video\">video</a> content is provided for <a href=\"#dfn-synchronized-media\">synchronized media</a>, except when the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> and is clearly labeled as such.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G69",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G58",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G78",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G173",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM6",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM7",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G8",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM1",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G203",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96"
        ]
    },
    {
        "rule": "wcag:1.2.4",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Live videos have captions.</dd>\n<dt>What to do</dt>\n<dd>Provide synchronized text for audio content in real-time videos.</dd>\n<dt>Why it's important</dt>\n<dd>People who are deaf or hard of hearing can understand audio in real-time video content.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to enable people who are deaf or hard of hearing\n                  to watch \n                  <em>real-time</em> presentations. Captions provide the part of the content available via the audio track.\n                  Captions not only include dialogue, but also identify who is speaking and notate sound\n                  effects and other significant audio.\n                  \n               </p>\n<p>This success criterion was intended to apply to broadcast of synchronized media and\n                  is not intended to require that two-way multimedia calls between two or more individuals\n                  through web apps must be captioned regardless of the needs of users. Responsibility\n                  for providing captions would fall to the content providers (the callers) or the “host”\n                  caller, and not the application.\n                  \n               </p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>People who are deaf or have a hearing loss can access the auditory information in\n                     the synchronized media content through captions.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>A Web cast</dt>\n<dd>A news organization provides a live, captioned Web cast. </dd>\n<dt>A music Web cast</dt>\n<dd>An orchestra provides Communication Access Realtime Translation (CART) captioning\n                     of each real-time Web performance. The CART service captures lyrics and dialog as\n                     well as identifies non-vocal music by title, movement, composer, and any information\n                     that will help the user comprehend the nature of the audio.\n                  </dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>See \n                     <a href=\"captions-prerecorded\">1.2.2: Captions (Prerecorded)</a>.\n                     \n                  </li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-ascii-art\">ascii art</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">picture created by a spatial arrangement of characters or glyphs (typically from the\n                           95 printable characters defined by ASCII)\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-assistive-technology\">assistive technology</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">hardware and/or software that acts as a <a href=\"#dfn-user-agent\">user agent</a>, or along with a mainstream user agent, to provide functionality to meet the requirements\n                           of users with disabilities that go beyond those offered by mainstream user agents\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Functionality provided by assistive technology includes alternative presentations\n                              (e.g., as synthesized speech or magnified content), alternative input methods (e.g.,\n                              voice), additional navigation or orientation mechanisms, and content transformations\n                              (e.g., to make tables more accessible).\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Assistive technologies often communicate data and messages with mainstream user agents\n                              by using and monitoring APIs.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The distinction between mainstream user agents and assistive technologies is not absolute.\n                              Many mainstream user agents provide some features to assist individuals with disabilities.\n                              The basic difference is that mainstream user agents target broad and diverse audiences\n                              that usually include people with and without disabilities. Assistive technologies\n                              target narrowly defined populations of users with specific disabilities. The assistance\n                              provided by an assistive technology is more specific and appropriate to the needs\n                              of its target users. The mainstream user agent may provide important functionality\n                              to assistive technologies like retrieving Web content from program objects or parsing\n                              markup into identifiable bundles.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Assistive technologies that are important in the context of this document include\n                              the following:\n                              \n                           </p>\n<ul>\n<li>screen magnifiers, and other visual reading assistants, which are used by people with\n                                 visual, perceptual and physical print disabilities to change text font, size, spacing,\n                                 color, synchronization with speech, etc. in order to improve the visual readability\n                                 of rendered text and images;\n                                 \n                              </li>\n<li>screen readers, which are used by people who are blind to read textual information\n                                 through synthesized speech or braille;\n                                 \n                              </li>\n<li>text-to-speech software, which is used by some people with cognitive, language, and\n                                 learning disabilities to convert text into synthetic speech;\n                                 \n                              </li>\n<li>speech recognition software, which may be used by people who have some physical disabilities;</li>\n<li>alternative keyboards, which are used by people with certain physical disabilities\n                                 to simulate the keyboard (including alternate keyboards that use head pointers, single\n                                 switches, sip/puff and other special input devices.);\n                                 \n                              </li>\n<li>alternative pointing devices, which are used by people with certain physical disabilities\n                                 to simulate mouse pointing and button activations.\n                                 \n                              </li>\n</ul>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-audio\">audio</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of sound reproduction</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio can be created synthetically (including speech synthesis), recorded from real\n                              world sounds, or both.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio-description\">audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">narration added to the soundtrack to describe important visual details that cannot\n                           be understood from the main soundtrack alone\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio description of <a href=\"#dfn-video\">video</a> provides information about actions, characters, scene changes, on-screen text, and\n                              other visual content.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In standard audio description, narration is added during existing pauses in dialogue.\n                              (See also <a href=\"#dfn-extended-audio-description\">extended audio description</a>.)\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Where all of the <a href=\"#dfn-video\">video</a> information is already provided in existing <a href=\"#dfn-audio\">audio</a>, no additional audio description is necessary.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Also called \"video description\" and \"descriptive narration.\"</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-captions\">captions</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">synchronized visual and/or <a href=\"#dfn-text-alternative\">text alternative</a> for both speech and non-speech audio information needed to understand the media content\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Captions are similar to dialogue-only subtitles except captions convey not only the\n                              content of spoken dialogue, but also equivalents for non-dialogue audio information\n                              needed to understand the program content, including sound effects, music, laughter,\n                              speaker identification and location.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Closed Captions are equivalents that can be turned on and off with some players.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Open Captions are any captions that cannot be turned off. For example, if the captions\n                              are visual equivalent <a href=\"#dfn-image-of-text\">images of text</a> embedded in <a href=\"#dfn-video\">video</a>.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Captions should not obscure or obstruct relevant information in the video.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In some countries, captions are called subtitles.</p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>\n<a href=\"#dfn-audio-description\">Audio descriptions</a> can be, but do not need to be, captioned since they are descriptions of information\n                              that is already presented visually.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-extended-audio-description\">extended audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">audio description that is added to an audiovisual presentation by pausing the <a href=\"#dfn-video\">video</a> so that there is time to add additional description\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This technique is only used when the sense of the <a href=\"#dfn-video\">video</a> would be lost without the additional <a href=\"#dfn-audio-description\">audio description</a> and the pauses between dialogue/narration are too short.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-human-language\">human language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">language that is spoken, written or signed (through visual or tactile means) to communicate\n                           with humans\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>See also <a href=\"#dfn-sign-language\">sign language</a>.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-image-of-text\">image of text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">text that has been rendered in a non-text form (e.g., an image) in order to achieve\n                           a particular visual effect\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This does not include <a href=\"#dfn-text\">text</a> that is part of a picture that contains significant other visual content.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A person's name on a nametag in a photograph.</p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-live\">live</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information captured from a real-world event and transmitted to the receiver with\n                           no more than a broadcast delay\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A broadcast delay is a short (usually automated) delay, for example used in order\n                              to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient\n                              to allow significant editing.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>If information is completely computer generated, it is not live.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-media-alternative-for-text\">media alternative for text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">media that presents no more information than is already presented in text (directly\n                           or via text alternatives)\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A media alternative for text is provided for those who benefit from alternate representations\n                              of text. Media alternatives for text may be audio-only, video-only (including sign-language\n                              video), or audio-video.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-non-text-content\">non-text content</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any content that is not a sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a> or where the sequence is not expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This includes <a href=\"#dfn-ascii-art\">ASCII Art</a> (which is a pattern of characters), emoticons, leetspeak (which uses character substitution),\n                              and images representing text\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-programmatically-determined\">programmatically determined</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">determined by software from author-supplied data provided in a way that different\n                           <a href=\"#dfn-user-agent\">user agents</a>, including <a href=\"#dfn-assistive-technology\">assistive technologies</a>, can extract and present this information to users in different modalities\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined in a markup language from elements and attributes that are accessed directly\n                              by commonly available assistive technology.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined from technology-specific data structures in a non-markup language and exposed\n                              to assistive technology via an accessibility API that is supported by commonly available\n                              assistive technology.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-sign-language\">sign language</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a language using combinations of movements of the hands and arms, facial expressions,\n                           or body positions to convey meaning\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-synchronized-media\">synchronized media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-audio\">audio</a> or <a href=\"#dfn-video\">video</a> synchronized with another format for presenting information and/or with time-based\n                           interactive components, unless the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> that is clearly labeled as such\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-text\">text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">sequence of characters that can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a>, where the sequence is expressing something in <a href=\"#dfn-human-language\">human language</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-text-alternative\">text alternative</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-text\">Text</a> that is programmatically associated with <a href=\"#dfn-non-text-content\">non-text content</a> or referred to from text that is programmatically associated with non-text content.\n                           Programmatically associated text is text whose location can be programmatically determined\n                           from the non-text content.\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>An image of a chart is described in text in the paragraph after the chart. The short\n                              text alternative for the chart indicates that a description follows.\n                              \n                           </p>\n</aside>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Refer to <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/conformance#text-alternatives\">Understanding Text Alternatives</a> for more information.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-user-agent\">user agent</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any software that retrieves and presents Web content for users</p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Web browsers, media players, plug-ins, and other programs — including <a href=\"#dfn-assistive-technology\">assistive technologies</a> — that help in retrieving, rendering, and interacting with Web content.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-video\">video</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of moving or sequenced pictures or images</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Video can be made up of animated or photographic images, or both.</p>\n</div>\n</definition>\n</dd>\n</details>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>\n<a href=\"#dfn-captions\">Captions</a> are provided for all <a href=\"#dfn-live\">live</a>\n<a href=\"#dfn-audio\">audio</a> content in <a href=\"#dfn-synchronized-media\">synchronized media</a>.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G93",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM11",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM12"
        ]
    },
    {
        "rule": "wcag:1.2.5",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Videos can be played with audio descriptions.</dd>\n<dt>What to do</dt>\n<dd>Provide a synchronized spoken description of the visual content in videos.</dd>\n<dt>Why it's important</dt>\n<dd>People who cannot see or understand the visual content can hear about it while playing\n                     videos.\n                  </dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to provide people who are blind or visually\n                  impaired access to the visual information in a synchronized media presentation. The\n                  audio description augments the audio portion of the presentation with the information\n                  needed when the video portion is not available. During existing pauses in dialogue,\n                  audio description provides information about actions, characters, scene changes, and\n                  on-screen text that are important and are not described or spoken in the main sound\n                  track.\n                  \n               </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<div>\n<p>\n                        For 1.2.3, 1.2.5, and 1.2.7, if all of the information in the video track is already\n                        provided in the audio track, no audio description is necessary. \n                        \n                        \n                        \n                     </p>\n<p>\n                        1.2.3, 1.2.5, and 1.2.8 overlap somewhat with each other. This is to give the author\n                        some choice at the minimum conformance level, and to provide additional requirements\n                        at higher levels. At Level A in Success Criterion 1.2.3, authors do have the choice\n                        of providing either an audio description or a full text alternative. If they wish\n                        to conform at Level AA, under Success Criterion 1.2.5 authors must provide an audio\n                        description - a requirement already met if they chose that alternative for 1.2.3,\n                        otherwise an additional requirement. At Level AAA under Success Criterion 1.2.8 they\n                        must provide an extended text description. This is an additional requirement if both\n                        1.2.3 and 1.2.5 were met by providing an audio description only. If 1.2.3 was met,\n                        however, by providing a text description, and the 1.2.5 requirement for an audio description\n                        was met, then 1.2.8 does not add new requirements.\n                        \n                     </p>\n</div>\n</div>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>People who are blind or have low vision as well as those with cognitive limitations\n                     who have difficulty interpreting visually what is happening benefit from audio description\n                     of visual information.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>A movie with audio description</dt>\n<dd>\n<p>\n<strong>Describer: </strong>A title, \"Teaching Evolution Case Studies. Bonnie Chen.\" A teacher shows photographs\n                        of birds with long, thin beaks.\n                        \n                     </p>\n<p>\n<strong>Bonnie Chen: </strong>\"These photos were all taken at the Everglades.\"\n                        \n                     </p>\n<p>\n<strong>Describer: </strong>The teacher hands each student two flat, thin wooden sticks.\n                        \n                     </p>\n<p>\n<strong>Bonnie Chen: </strong>\"Today you will pretend to be a species of wading bird that has a beak like this.\"\n                        \n                     </p>\n<p>\n<strong>Describer: </strong>The teacher holds two of the sticks to her mouth making the shape of a beak.\n                        \n                     </p>\n<p>Transcript of audio based on the first few minutes of \"<a href=\"http://www.pbs.org/wgbh/evolution/educators/teachstuds/tvideos.html\">Teaching Evolution Case Studies, Bonnie Chen</a>\" (copyright WGBH and Clear Blue Sky Productions, Inc.)\n                     </p>\n</dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>\n<a href=\"http://ncam.wgbh.org/invent_build/web_multimedia/accessible-digital-media-guide/guideline-h-multimedia#techH12\">NCAM Rich Media Accessibility, Accessible SMIL Templates</a>\n</li>\n<li>\n<a href=\"http://joeclark.org/access/description/ad-principles.html\">Standard Techniques in Audio Description</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/REC-smil/\">Synchronized Multimedia Integration Language (SMIL) 1.0</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL/\">Synchronized Multimedia Integration Language (SMIL 2.0)</a>\n</li>\n<li>\n<a href=\"https://www.w3.org/TR/SMIL-access/\">Accessibility Features of SMIL</a>\n</li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-audio\">audio</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of sound reproduction</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio can be created synthetically (including speech synthesis), recorded from real\n                              world sounds, or both.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-audio-description\">audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">narration added to the soundtrack to describe important visual details that cannot\n                           be understood from the main soundtrack alone\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Audio description of <a href=\"#dfn-video\">video</a> provides information about actions, characters, scene changes, on-screen text, and\n                              other visual content.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>In standard audio description, narration is added during existing pauses in dialogue.\n                              (See also <a href=\"#dfn-extended-audio-description\">extended audio description</a>.)\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Where all of the <a href=\"#dfn-video\">video</a> information is already provided in existing <a href=\"#dfn-audio\">audio</a>, no additional audio description is necessary.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Also called \"video description\" and \"descriptive narration.\"</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-extended-audio-description\">extended audio description</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">audio description that is added to an audiovisual presentation by pausing the <a href=\"#dfn-video\">video</a> so that there is time to add additional description\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>This technique is only used when the sense of the <a href=\"#dfn-video\">video</a> would be lost without the additional <a href=\"#dfn-audio-description\">audio description</a> and the pauses between dialogue/narration are too short.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-live\">live</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information captured from a real-world event and transmitted to the receiver with\n                           no more than a broadcast delay\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A broadcast delay is a short (usually automated) delay, for example used in order\n                              to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient\n                              to allow significant editing.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>If information is completely computer generated, it is not live.</p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-media-alternative-for-text\">media alternative for text</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">media that presents no more information than is already presented in text (directly\n                           or via text alternatives)\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>A media alternative for text is provided for those who benefit from alternate representations\n                              of text. Media alternatives for text may be audio-only, video-only (including sign-language\n                              video), or audio-video.\n                              \n                           </p>\n</div>\n</definition>\n</dd>\n<dt id=\"dfn-prerecorded\">prerecorded</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information that is not <a href=\"#dfn-live\">live</a>\n</p>\n</definition>\n</dd>\n<dt id=\"dfn-synchronized-media\">synchronized media</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">\n<a href=\"#dfn-audio\">audio</a> or <a href=\"#dfn-video\">video</a> synchronized with another format for presenting information and/or with time-based\n                           interactive components, unless the media is a <a href=\"#dfn-media-alternative-for-text\">media alternative for text</a> that is clearly labeled as such\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-video\">video</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">the technology of moving or sequenced pictures or images</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Video can be made up of animated or photographic images, or both.</p>\n</div>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/c5a4ea/proposed/\">Video element visual content has accessible alternative</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/1ec09b/proposed/\">Video element visual content has strict accessible alternative</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>\n<a href=\"#dfn-audio-description\">Audio description</a> is provided for all <a href=\"#dfn-prerecorded\">prerecorded</a>\n<a href=\"#dfn-video\">video</a> content in <a href=\"#dfn-synchronized-media\">synchronized media</a>.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G78",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G173",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM6",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM7",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G8",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM1",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G203",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96"
        ]
    },
    {
        "rule": "wcag:1.3.1",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Information about content structure is available to more people.</dd>\n<dt>What to do</dt>\n<dd>Use code to reinforce relationships and information conveyed through presentation.</dd>\n<dt>Why it's important</dt>\n<dd>People can adapt the presentation to suit their needs while preserving the original\n                     meaning.\n                  </dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to ensure that information and relationships\n                  that are implied by visual or auditory formatting are preserved when the presentation\n                  format changes. For example, the presentation format changes when the content is read\n                  by a screen reader or when a user style sheet is substituted for the style sheet provided\n                  by the author.\n                  \n               </p>\n<p>\n                  \t\t\t\t\t\tSighted users perceive structure and relationships through various visual cues\n                  — headings are often in a larger, bold font separated from paragraphs by blank lines;\n                  list items are preceded by a bullet and perhaps indented; paragraphs are separated\n                  by a blank line; items that share a common characteristic are organized into tabular\n                  rows and columns; form fields may be positioned as groups that share text labels;\n                  a different background color may be used to indicate that several items are related\n                  to each other; words that have special status are indicated by changing the font family\n                  and /or bolding, italicizing, or underlining them; items that share a common characteristic\n                  are organized into a table where the relationship of cells sharing the same row or\n                  column and the relationship of each cell to its row and/or column header are necessary\n                  for understanding; and so on. Having these structures and these relationships programmatically\n                  determined or available in text ensures that information important for comprehension\n                  will be perceivable to all.\n                  \n                  \n               </p>\n<p>Auditory cues may be used as well. For example, a chime might indicate the beginning\n                  of a new section; a change in voice pitch or speech rate may be used to emphasize\n                  important information or to indicate quoted text; etc.\n                  \n               </p>\n<p>\n                  When such relationships are perceivable to one set of users, those relationships can\n                  be made to be perceivable to all. One method of determining whether or not information\n                  has been properly provided to all users is to access the information serially in different\n                  modalities.\n                  \n                  \n               </p>\n<p>If links to glossary items are implemented using anchor elements (or the proper link\n                  element for the technology in use) and identified using a different font face, a screen\n                  reader user will hear that the item is a link when the glossary term is encountered\n                  even though they may not receive information about the change in font face. An on-line\n                  catalog may indicate prices using a larger font colored red. A screen reader or person\n                  who cannot perceive red, still has the information about the price as long as it is\n                  preceded by the currency symbol.\n                  \n               </p>\n<p>Some technologies do not provide a means to programmatically determine some types\n                  of information and relationships. In that case then there should be a text description\n                  of the information and relationships. For instance, \"all required fields are marked\n                  with an asterisk (*)\". The text description should be near the information it is describing\n                  (when the page is linearized), such as in the parent element or in the adjacent element.\n                  \n               </p>\n<p>There may also be cases where it may be a judgment call as to whether the relationships\n                  should be programmatically determined or be presented in text. However, when technologies\n                  support programmatic relationships, it is strongly encouraged that information and\n                  relationships be programmatically determined rather than described in text.\n                  \n               </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<div>\n<p>It is not required that color values be programmatically determined. The information\n                        conveyed by color cannot be adequately presented simply by exposing the value. Therefore,\n                        \n                        <a class=\"guideline\" href=\"use-of-color\">Success Criterion 1.4.1\n                           \n                           </a> addresses the specific case of color, rather than Success Criterion 1.3.1.\n                        \n                        \n                     </p>\n</div>\n</div>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>This Success Criterion helps people with different disabilities by allowing user agents\n                     to adapt content according to the needs of individual users.\n                     \n                     \n                  </li>\n<li>Users who are blind (using a screen reader) benefit when information conveyed through\n                     color is also available in text (including text alternatives for images that use color\n                     to convey information).\n                     \n                  </li>\n<li>Users who are deaf-blind using braille (text) refreshable displays may be unable to\n                     access color-dependent information.\n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>A form with required fields</dt>\n<dd>A form contains several required fields. The labels for the required fields are displayed\n                     in red. In addition, at the end of each label is an asterisk character, *. The instructions\n                     for completing the form indicate that \"all required fields are displayed in red and\n                     marked with an asterisk *\", followed by an example.\n                  </dd>\n<dt>A form that uses color and text to indicate required fields</dt>\n<dd>A form contains both required and optional fields. Instructions at the top of the\n                     form explain that required fields are labeled with red text and also with an icon\n                     whose text alternative says, \"Required.\" Both the red text and the icon are programmatically\n                     associated with the appropriate form fields so that assistive technology users can\n                     determine the required fields.\n                  </dd>\n<dt>A bus schedule table where the headers for each cell can be programmatically determined</dt>\n<dd>A bus schedule consists of a table with the bus stops listed vertically in the first\n                     column and the different buses listed horizontally across the first row. Each cell\n                     contains the time when the bus will be at that bus stop. The bus stop and bus cells\n                     are identified as headers for their corresponding row or column so that assistive\n                     technology can programmatically determine which bus and which bus stop are associated\n                     with the time in each cell.\n                  </dd>\n<dt>A form where the labels for the checkboxes can be programmatically determined</dt>\n<dd>In a form, the labels for each checkbox can be programmatically determined by assistive\n                     technology.\n                  </dd>\n<dt>A text document</dt>\n<dd>A simple text document is formatted with double blank lines before titles, asterisks\n                     to indicate list items and other standard formatting conventions so that its structure\n                     can be programmatically determined.\n                  </dd>\n</dl>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li>\n<a href=\"http://webaim.org/techniques/semanticstructure/\">WebAIM: Semantic Structure</a>\n</li>\n<li>\n<a href=\"http://accessibility.psu.edu/headingshtml/\">Heading Tags</a>\n</li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-assistive-technology\">assistive technology</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">hardware and/or software that acts as a <a href=\"#dfn-user-agent\">user agent</a>, or along with a mainstream user agent, to provide functionality to meet the requirements\n                           of users with disabilities that go beyond those offered by mainstream user agents\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Functionality provided by assistive technology includes alternative presentations\n                              (e.g., as synthesized speech or magnified content), alternative input methods (e.g.,\n                              voice), additional navigation or orientation mechanisms, and content transformations\n                              (e.g., to make tables more accessible).\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Assistive technologies often communicate data and messages with mainstream user agents\n                              by using and monitoring APIs.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The distinction between mainstream user agents and assistive technologies is not absolute.\n                              Many mainstream user agents provide some features to assist individuals with disabilities.\n                              The basic difference is that mainstream user agents target broad and diverse audiences\n                              that usually include people with and without disabilities. Assistive technologies\n                              target narrowly defined populations of users with specific disabilities. The assistance\n                              provided by an assistive technology is more specific and appropriate to the needs\n                              of its target users. The mainstream user agent may provide important functionality\n                              to assistive technologies like retrieving Web content from program objects or parsing\n                              markup into identifiable bundles.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Assistive technologies that are important in the context of this document include\n                              the following:\n                              \n                           </p>\n<ul>\n<li>screen magnifiers, and other visual reading assistants, which are used by people with\n                                 visual, perceptual and physical print disabilities to change text font, size, spacing,\n                                 color, synchronization with speech, etc. in order to improve the visual readability\n                                 of rendered text and images;\n                                 \n                              </li>\n<li>screen readers, which are used by people who are blind to read textual information\n                                 through synthesized speech or braille;\n                                 \n                              </li>\n<li>text-to-speech software, which is used by some people with cognitive, language, and\n                                 learning disabilities to convert text into synthetic speech;\n                                 \n                              </li>\n<li>speech recognition software, which may be used by people who have some physical disabilities;</li>\n<li>alternative keyboards, which are used by people with certain physical disabilities\n                                 to simulate the keyboard (including alternate keyboards that use head pointers, single\n                                 switches, sip/puff and other special input devices.);\n                                 \n                              </li>\n<li>alternative pointing devices, which are used by people with certain physical disabilities\n                                 to simulate mouse pointing and button activations.\n                                 \n                              </li>\n</ul>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-content\">content</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">information and sensory experience to be communicated to the user by means of a <a href=\"#dfn-user-agent\">user agent</a>, including code or markup that defines the content's <a href=\"#dfn-structure\">structure</a>, <a href=\"#dfn-presentation\">presentation</a>, and interactions\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-presentation\">presentation</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">rendering of the <a href=\"#dfn-content\">content</a> in a form to be perceived by users\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-programmatically-determined\">programmatically determined</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">determined by software from author-supplied data provided in a way that different\n                           <a href=\"#dfn-user-agent\">user agents</a>, including <a href=\"#dfn-assistive-technology\">assistive technologies</a>, can extract and present this information to users in different modalities\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined in a markup language from elements and attributes that are accessed directly\n                              by commonly available assistive technology.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined from technology-specific data structures in a non-markup language and exposed\n                              to assistive technology via an accessibility API that is supported by commonly available\n                              assistive technology.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-relationships\">relationships</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">meaningful associations between distinct pieces of content</p>\n</definition>\n</dd>\n<dt id=\"dfn-structure\">structure</dt>\n<dd>\n<definition xmlns=\"\">\n<ol xmlns=\"http://www.w3.org/1999/xhtml\">\n<li>The way the parts of a <a href=\"#dfn-web-page\">Web page</a> are organized in relation to each other; and\n                              \n                           </li>\n<li>The way a collection of <a href=\"#dfn-web-page\">Web pages</a> is organized\n                              \n                           </li>\n</ol>\n</definition>\n</dd>\n<dt id=\"dfn-user-agent\">user agent</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any software that retrieves and presents Web content for users</p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Web browsers, media players, plug-ins, and other programs — including <a href=\"#dfn-assistive-technology\">assistive technologies</a> — that help in retrieving, rendering, and interacting with Web content.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-web-page\">web page</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">a non-embedded resource obtained from a single URI using HTTP plus any other resources\n                           that are used in the rendering or intended to be rendered together with it by a <a href=\"#dfn-user-agent\">user agent</a>\n</p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Although any \"other resources\" would be rendered together with the primary resource,\n                              they would not necessarily be rendered simultaneously with each other.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>For the purposes of conformance with these guidelines, a resource must be \"non-embedded\"\n                              within the scope of conformance to be considered a Web page.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A Web resource including all embedded images and media.</p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program\n                              lives entirely at http://example.com/mail, but includes an inbox, a contacts area\n                              and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar\n                              to display, but do not change the URI of the page as a whole.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>A customizable portal site, where users can choose content to display from a set of\n                              different content modules.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like\n                              interactive shopping environment where you visually move around in a store dragging\n                              products off of the shelves around you and into a visual shopping cart in front of\n                              you. Clicking on a product causes it to be demonstrated with a specification sheet\n                              floating alongside. This might be a single-page Web site or just one page within a\n                              Web site.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/5f99a7/\">ARIA attribute is defined in WAI-ARIA</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/6a7281/\">ARIA state or property has valid value</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/a25f45/\">Headers attribute specified on a cell refers to cells in the same table element</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/674b10/\">Role attribute has valid value</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/ff89c9/proposed/\">ARIA required context role</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/in6db8/proposed/\">ARIA required ID references exist</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/bc4a75/proposed/\">ARIA required owned elements</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/5c01ea/proposed/\">ARIA state or property is permitted</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/4e8ab6/proposed/\">Element with role attribute has required states and properties</a></li>\n<li><a href=\"/WAI/standards-guidelines/act/rules/d0f69e/proposed/\">Table header cell has assigned cells</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>Information, <a href=\"#dfn-structure\">structure</a>, and <a href=\"#dfn-relationships\">relationships</a> conveyed through <a href=\"#dfn-presentation\">presentation</a> can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a> or are available in text.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA11",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H101",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA12",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA13",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA16",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA17",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA20",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G115",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H49",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G117",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G140",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA24",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G138",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H51",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF6",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF20",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H39",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H63",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H43",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H44",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H65",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF10",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF12",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H71",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H85",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H48",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H42",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF9",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF11",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF17",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF21",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H97",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G117",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T1",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T2",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T3",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C22",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G162",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA1",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G141",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F2",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F33",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F34",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F42",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F43",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F46",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F48",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F87",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F90",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F91",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F92"
        ]
    },
    {
        "rule": "wcag:1.3.2",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>The order of content can be understood by more people.</dd>\n<dt>What to do</dt>\n<dd>Use code to preserve meaningful content order.</dd>\n<dt>Why it's important</dt>\n<dd>Assistive technology can present content to users in the proper order.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to enable a user agent to provide an alternative\n                  presentation of content while preserving the reading order needed to understand the\n                  meaning. It is important that it be possible to programmatically determine at least\n                  one sequence of the content that makes sense. Content that does not meet this Success\n                  Criterion may confuse or disorient users when assistive technology reads the content\n                  in the wrong order, or when alternate style sheets or other formatting changes are\n                  applied.\n                  \n                  \n               </p>\n<p>A sequence is \n                  <em>meaningful</em> if the order of content in the sequence cannot be changed without affecting its meaning.\n                  \n                  For example, if a page contains two independent articles, the relative order of the\n                  articles may not affect their meaning, as long as they are not interleaved. In such\n                  a situation, the articles themselves may have meaningful sequence, but the container\n                  that contains the articles may not have a meaningful sequence.\n                  \n               </p>\n<p>The semantics of some elements define whether or not their content is a meaningful\n                  sequence. For instance, in HTML, text is always a meaningful sequence. Tables and\n                  ordered lists are meaningful sequences, but unordered lists are not.\n                  \n               </p>\n<p>The order of content in a sequence is not always meaningful. For example, the relative\n                  order of the main section of a Web page and a navigation section does not affect their\n                  meaning. They could occur in either order in the programmatically determined reading\n                  sequence. As another example, a magazine article contains several callout sidebars.\n                  The order of the article and the sidebars does not affect their meaning. In these\n                  cases there are a number of different reading orders for a Web page that can satisfy\n                  the Success Criterion. \n                  \n                  \n               </p>\n<p>For clarity:</p>\n<ul>\n<li>Providing a particular linear order is only required where it affects meaning.</li>\n<li>There may be more than one order that is \"correct\" (according to the WCAG 2.0 definition).</li>\n<li>Only one correct order needs to be provided.</li>\n</ul>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>This Success Criterion may help people who rely on assistive technologies that read\n                     content aloud. The meaning evident in the sequencing of the information in the default\n                     presentation will be the same when the content is presented in spoken form.\n                     \n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<ul>\n<li>\n<strong>Example 1:</strong> In a multi-column document, the linear presentation of the content flows from the\n                     top of a column to the bottom of the column, then to the top of the next column.\n                     \n                  </li>\n<li>\n<strong>Example 2:</strong> CSS is used to position a navigation bar, the main story on a page, and a side story.\n                     The visual presentation of the sections does not match the programmatically determined\n                     order, but the meaning of the page does not depend on the order of the sections.\n                     \n                  </li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-assistive-technology\">assistive technology</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">hardware and/or software that acts as a <a href=\"#dfn-user-agent\">user agent</a>, or along with a mainstream user agent, to provide functionality to meet the requirements\n                           of users with disabilities that go beyond those offered by mainstream user agents\n                           \n                        </p>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Functionality provided by assistive technology includes alternative presentations\n                              (e.g., as synthesized speech or magnified content), alternative input methods (e.g.,\n                              voice), additional navigation or orientation mechanisms, and content transformations\n                              (e.g., to make tables more accessible).\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>Assistive technologies often communicate data and messages with mainstream user agents\n                              by using and monitoring APIs.\n                              \n                           </p>\n</div>\n<div class=\"note\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p class=\"note-title marker\">Note</p>\n<p>The distinction between mainstream user agents and assistive technologies is not absolute.\n                              Many mainstream user agents provide some features to assist individuals with disabilities.\n                              The basic difference is that mainstream user agents target broad and diverse audiences\n                              that usually include people with and without disabilities. Assistive technologies\n                              target narrowly defined populations of users with specific disabilities. The assistance\n                              provided by an assistive technology is more specific and appropriate to the needs\n                              of its target users. The mainstream user agent may provide important functionality\n                              to assistive technologies like retrieving Web content from program objects or parsing\n                              markup into identifiable bundles.\n                              \n                           </p>\n</div>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Assistive technologies that are important in the context of this document include\n                              the following:\n                              \n                           </p>\n<ul>\n<li>screen magnifiers, and other visual reading assistants, which are used by people with\n                                 visual, perceptual and physical print disabilities to change text font, size, spacing,\n                                 color, synchronization with speech, etc. in order to improve the visual readability\n                                 of rendered text and images;\n                                 \n                              </li>\n<li>screen readers, which are used by people who are blind to read textual information\n                                 through synthesized speech or braille;\n                                 \n                              </li>\n<li>text-to-speech software, which is used by some people with cognitive, language, and\n                                 learning disabilities to convert text into synthetic speech;\n                                 \n                              </li>\n<li>speech recognition software, which may be used by people who have some physical disabilities;</li>\n<li>alternative keyboards, which are used by people with certain physical disabilities\n                                 to simulate the keyboard (including alternate keyboards that use head pointers, single\n                                 switches, sip/puff and other special input devices.);\n                                 \n                              </li>\n<li>alternative pointing devices, which are used by people with certain physical disabilities\n                                 to simulate mouse pointing and button activations.\n                                 \n                              </li>\n</ul>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-correct-reading-sequence\">correct reading sequence</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any sequence where words and paragraphs are presented in an order that does not change\n                           the meaning of the content\n                           \n                        </p>\n</definition>\n</dd>\n<dt id=\"dfn-programmatically-determined\">programmatically determined</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">determined by software from author-supplied data provided in a way that different\n                           <a href=\"#dfn-user-agent\">user agents</a>, including <a href=\"#dfn-assistive-technology\">assistive technologies</a>, can extract and present this information to users in different modalities\n                           \n                        </p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined in a markup language from elements and attributes that are accessed directly\n                              by commonly available assistive technology.\n                              \n                           </p>\n</aside>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Determined from technology-specific data structures in a non-markup language and exposed\n                              to assistive technology via an accessibility API that is supported by commonly available\n                              assistive technology.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n<dt id=\"dfn-user-agent\">user agent</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">any software that retrieves and presents Web content for users</p>\n<aside class=\"example\" xmlns=\"http://www.w3.org/1999/xhtml\">\n<p>Web browsers, media players, plug-ins, and other programs — including <a href=\"#dfn-assistive-technology\">assistive technologies</a> — that help in retrieving, rendering, and interacting with Web content.\n                              \n                           </p>\n</aside>\n</definition>\n</dd>\n</details>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>When the sequence in which content is presented affects its meaning, a <a href=\"#dfn-correct-reading-sequence\">correct reading sequence</a> can be <a href=\"#dfn-programmatically-determined\">programmatically determined</a>.\n                     \n                  </p>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G57",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G57",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H34",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H56",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C6",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C8",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C27",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF3",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F34",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F33",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F32",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F49",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F1"
        ]
    },
    {
        "rule": "wcag:1.3.3",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Instructions are understandable by more people.</dd>\n<dt>What to do</dt>\n<dd> Describe controls by name, not just by appearance or location.</dd>\n<dt>Why it's important</dt>\n<dd>People who are blind or have low vision need non-visual instructions.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to ensure that all users can access instructions\n                  for using the content, even when they cannot perceive shape or size or use information\n                  about spatial location or orientation. \n                  Some content relies on knowledge of the shape or position of objects that are not\n                  available from the structure of the content (for example, \"round button\" or \"button\n                  to the right\"). \n                  Some users with disabilities are not able to perceive shape or position due to the\n                  nature of the assistive technologies they use. \n                  This Success Criterion requires that additional information be provided to clarify\n                  instructions that are dependent on this kind of information.         \n                  \n               </p>\n<p>Providing information using shape and/or location, however, is an effective method\n                  for many users including those with cognitive limitations.\n                  This provision should not discourage those types of cues as long as the information\n                  is also provided in other ways.\n                  \n               </p>\n<p>In some languages, it is commonly understood that \"above\" refers to the content previous\n                  to that point in the content and \"below\" refers to the content after that point. In\n                  such languages, if the content being referenced is in the appropriate place in the\n                  reading order and the references are unambiguous, statements such as \"choose one of\n                  the links below\" or \"all of the above\" would conform to this Success Criterion. \n                  \n               </p>\n<p>WCAG was designed to apply only to controls that were displayed on a web page. The\n                  intent was to avoid describing controls solely via references to visual or auditory\n                  cues. When applying this to instructions for operating physical hardware controls\n                  (e.g. a web kiosk with dedicated content), tactile cues on the hardware might be described\n                  (e.g. the arrow shaped key, the round key on the right side). This success criterion\n                  is not intended to prevent the use of tactile cues in instructions.\n                  \n               </p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>People who are blind and people who have low vision may not be able to understand\n                     instructions if they rely only on a description of the shape and/or location of content.\n                     Providing additional information in any instructions other than shape and/or location\n                     will allow users to understand the instructions even if they cannot perceive shape\n                     and/or location.          \n                     \n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<dl>\n<dt>Example 1: Instructions for interpreting a schedule of competitive events references\n                     colored icons in different shapes to indicate the venue for each event\n                  </dt>\n<dd>A table presents a list of times across the top row and a list of events in the first\n                     vertical column and instructions are provided under the table: \"Events marked with\n                     a\n                     blue diamond are played on field A and events marked with a green circle are played\n                     on field B.\" The instructions rely on color and shape only and result in a failure\n                     of\n                     this criterion.\n                  </dd>\n<dt>Example 2: An online multi-page survey</dt>\n<dd>An online multi-page survey uses a link implemented as a green arrow icon placed\n                     in the lower right hand corner of the content to move from one survey page to the\n                     next. The arrow is clearly labeled with \"Next\" and the instructions state, \"To move\n                     to the next section of the survey, select the green arrow icon labeled 'Next' in the\n                     lower right corner below the last survey question.\" \n                     The instruction uses positioning and color to help identify the icon; \n                     the instruction does not rely on these sensory characteristics since it also refers\n                     to\n                     the label, so it passes this criterion.\n                  </dd>\n</dl>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/9bd38c/proposed/\">Content has alternative for visual reference</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>Instructions provided for understanding and operating content do not rely solely on\n                     sensory characteristics of components such as shape, color, size, visual location,\n                     orientation,\n                     or sound.\n                     \n                  </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<p>For requirements related to color, refer to <a href=\"#distinguishable\">Guideline 1.4</a>.\n                     </p>\n</div>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G96",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F14",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F26"
        ]
    },
    {
        "rule": "wcag:1.3.4",
        "understanding": {
            "brief": "<section id=\"brief\">\n<h2>In Brief</h2>\n<dl>\n<dt>Goal</dt>\n<dd>Devices can be used in any orientation.</dd>\n<dt>What to do</dt>\n<dd>Don't lock content to either portrait or landscape presentation.</dd>\n<dt>Why it's important</dt>\n<dd>Wheelchair users and others may have devices mounted in a fixed orientation.</dd>\n</dl>\n</section>",
            "intent": "<section id=\"intent\">\n<h2>Intent</h2>\n<p>The intent of this Success Criterion is to ensure that content displays in the orientation\n                  (portrait or landscape) preferred by the user. Some websites and applications automatically\n                  set and restrict the screen to a particular display orientation and expect\n                  \t\t\tthat users will respond by rotating their device to match, but this can create\n                  problems. Some users have their devices mounted\n                  \t\t\tin a fixed orientation (e.g. on the arm of a power wheelchair). Therefore, websites\n                  and applications need to support both orientations\n                  \t\t\tby not restricting the orientation. Changes in content or functionality due to\n                  the size of display are not covered by this criterion which is focused on restrictions\n                  of orientation.\n               </p>\n<p>Historically, devices tended to have a fixed-orientation display, and all content\n                  was created to match that display orientation. Today, most handhelds and many other\n                  devices (e.g., monitors) have a hardware-level ability to dynamically adjust default\n                  display orientation based on sensor information. The goal of this Success Criterion\n                  is that authors should never restrict content's orientation, thus ensuring that it\n                  always match the device display orientation.\n               </p>\n<p>It is important to distinguish between an author's responsibility not to restrict\n                  content to a specific orientation, and device-specific settings governing the locking\n                  of display orientation.\n               </p>\n<p>Many hand-held devices offer a mechanical switch or a system setting (or both) to\n                  allow the user to lock the device display to a specific orientation. Where a user\n                  decides to lock their entire device to an orientation, all applications are expected\n                  to pick up that setting and to display content accordingly.\n               </p>\n<p>This Success Criterion complements device \"lock orientation\" settings. A web page\n                  that does not restrict its display orientation will always support the system-level\n                  orientation setting, since the system setting is picked up by the user agent. Alternatively,\n                  where a device-level orientation lock is not in place, the user agent should display\n                  the page according to the orientation of the device (either its default, or the current\n                  orientation determined by any device sensors).\n               </p>\n<p>The exception for things considered essential is aimed at situations where the content\n                  would only be understood in a particular orientation, or where the technology restricts\n                  the possible orientations. If content is aimed at a specific environment which is\n                  only available in one orientation (such as a television) then the content can restrict\n                  the orientation. Technologies such as virtual reality use screens within goggles that\n                  cannot change orientation relative to the user's eyes.\n               </p>\n</section>",
            "benefits": "<section id=\"benefits\">\n<h2>Benefits</h2>\n<ul>\n<li>Users with dexterity impairments, who have a mounted device will be able to use the\n                     content in their fixed orientation.\n                  </li>\n<li>Users with low-vision will be able to view content in the orientation that works best\n                     for them, for example to increase the text size by viewing content in landscape.\n                  </li>\n</ul>\n</section>",
            "examples": "<section id=\"examples\">\n<h2>Examples</h2>\n<ul>\n<li><strong>Example 1: Online video site</strong><br/>\n                     \t\t\t\tA video is shown in either portrait or in landscape based on the user's chosen\n                     orientation.\n                  </li>\n<li><strong>Example 2: Messaging website</strong><br/>\n                     \t\t\t\tA messaging website can display messages in both portrait and landscape orientations.\n                     \n                  </li>\n<li><strong>Example 3: eReader web app</strong><br/>\n                     \t\t\t\tAn eReader web app can display the contents of a book in both portrait and landscape\n                     orientation.\n                  </li>\n<li><strong>Example 4: Check deposit in banking app</strong><br/>\n                     \t\t\t\tAn example where orientation is essential could be a banking app that requires\n                     the device be in landscape mode to easily and accurately capture an image of a check\n                     for deposit. These paper forms are typically about twice as wide as they are high.\n                  </li>\n<li><strong>Example 5: Piano app</strong><br/>\n                     \t\t\t\tAn example where orientation is essential could be a piano app that requires the\n                     device to be in landscape mode to allow room for enough of the piano keys to be functionally\n                     usable. Since a piano app is emulating a physical piano keyboard that needs to retain\n                     relative physical characteristics between keys, either too few keys would be available,\n                     or the keys would be much too narrow.\n                  </li>\n</ul>\n</section>",
            "resources": "<section id=\"resources\">\n<h2>Related Resources</h2>\n<p>Resources are for information purposes only, no endorsement implied.</p>\n<ul>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/CSS_Object_Model/Managing_screen_orientation\">Managing Screen Orientation</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Media_Queries/Using_media_queries\">Using Media Queries</a></li>\n<li><a href=\"https://css-tricks.com/snippets/css/media-queries-for-standard-devices/\">Media Queries for Standard Devices</a></li>\n<li><a href=\"https://css-tricks.com/snippets/css/orientation-lock/\">Orientation Lock</a></li>\n<li><a href=\"https://css-tricks.com/forums/topic/responsive-design-for-landscape-orientation/\">Responsive Design for Landscape Orientation</a></li>\n<li><a href=\"https://www.w3.org/TR/css-device-adapt-1/#orientation-desc\">The Orientation Descriptor</a></li>\n<li><a href=\"https://www.w3.org/TR/screen-orientation/\">The Screen Orientation API</a></li>\n</ul>\n</section>",
            "key-terms": "<section id=\"key-terms\">\n<details>\n<summary>\n<h2>Key Terms</h2>\n</summary>\n<dt id=\"dfn-essential\">essential</dt>\n<dd>\n<definition xmlns=\"\">\n<p xmlns=\"http://www.w3.org/1999/xhtml\">if removed, would fundamentally change the information or functionality of the content,\n                           <strong>and</strong> information and functionality cannot be achieved in another way that would conform\n                           \n                        </p>\n</definition>\n</dd>\n</details>\n</section>",
            "test-rules": "<section id=\"test-rules\">\n<h2>Test Rules</h2>\n<p>The following are Test Rules for certain aspects of this Success Criterion. It is\n                  not necessary to use these particular Test Rules to check for conformance with WCAG,\n                  but they are defined and approved test methods. For information on using Test Rules,\n                  see <a href=\"understanding-act-rules.html\">Understanding Test Rules for WCAG Success Criteria</a>.\n               </p>\n<ul>\n<li><a href=\"/WAI/standards-guidelines/act/rules/b33eff/proposed/\">Orientation of the page is not restricted using CSS transforms</a></li>\n</ul>\n</section>",
            "box": "<aside class=\"box\">\n<header class=\"box-h box-h-icon\">Success Criterion (SC) </header>\n<div class=\"box-i\">\n<p>Content does not restrict its view and operation to a single display orientation,\n                     such as portrait or landscape, unless a specific display orientation is <a href=\"#dfn-essential\">essential</a>.\n                  </p>\n<div class=\"note\">\n<p class=\"note-title marker\">Note</p>\n<p>Examples where a particular display orientation may be essential are a bank check,\n                        a piano application, slides for a projector or television, or virtual reality content\n                        where content is not necessarily restricted to landscape or portrait display orientation.\n                     </p>\n</div>\n</div>\n</aside>"
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G214",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F97",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F100"
        ]
    }
]