[
    {
        "rule": "wcag:1.2.1",
        "understanding": {
            "brief": " In Brief Goal Audio and video-only content can be understood by more people. What to do Provide an alternative when content is perceivable with only one sense. Why it's important People who can’t fully see or hear content can understand it. ",
            "intent": " Intent The intent of this Success Criterion is to make information conveyed by prerecorded audio-only and prerecorded video-only content available to all users. Alternatives for time-based media that are text based make information accessible because text can be rendered through any sensory modality (for example, visual, auditory or tactile) to match the needs of the user. In the future, text could also be translated into symbols, sign language or simpler forms of the language (future). An example of pre-recorded video with no audio information or user interaction is a silent movie. The purpose of the transcript is to provide an equivalent to what is presented visually. For prerecorded video content, authors have the option to provide an audio track. The purpose of the audio alternative is to be an equivalent to the video. This makes it possible for users with and without vision impairment to review content simultaneously. The approach can also make it easier for those with cognitive, language and learning disabilities to understand the content because it would provide parallel presentation. Note A text equivalent is not required for audio that is provided as an equivalent for video with no audio information. For example, it is not required to caption audio description that is provided as an alternative to a silent movie. See also 1.2.4: Audio-only (Live) ",
            "benefits": " Benefits This Success Criterion helps people who have difficulty perceiving visual content. Assistive technology can read text alternatives aloud, present them visually, or convert them to braille. Alternatives for timed-based media that are text based may help some people who have difficulty understanding the meaning of prerecorded video content. People who are deaf, are hard of hearing, or who are having trouble understanding audio information for any reason can read the text presentation. Research is ongoing regarding automatic translation of text into sign language. People who are deaf-blind can read the text in braille. Additionally, text supports the ability to search for non-text content and to repurpose content in a variety of ways. ",
            "examples": " Examples An audio recording of a speech The link to an audio clip says, \"Chairman's speech to the assembly.\" A link to a text transcript is provided immediately after the link to the audio clip. An audio recording of a press conference A Web page includes a link to an audio recording of a press conference that identifies the audio recording. The page also links to a text transcript of the press conference. The transcript includes a verbatim record of everything the speakers say. It identifies who is speaking as well as noting other significant sounds that are part of the recording, such as applause, laughter, questions from the audience, and so on. An animation that illustrates how a car engine works An animation shows how a car engine works. There is no audio and the animation is part of a tutorial that describes how an engine works. Since the text of the tutorial already provides a full explanation, the media is an alternative for text and the text alternative includes only a brief description of the animation and refers to the tutorial text for more information. A video-only file with an audio track A silent movie includes an audio track which includes a description of the action in the video. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. Overcoming the challenge of podcast transcription uiAccess list of transcription services Transcripts on the Web: Getting people to your podcasts and videos ",
            "key-terms": " Key Terms alternative for time-based media document including correctly sequenced text descriptions of time-based visual and auditory information and providing a means for achieving the outcomes of any time-based interaction Note A screenplay used to create the synchronized media content would meet this definition only if it was corrected to accurately represent the final synchronized media after editing. audio the technology of sound reproduction Note Audio can be created synthetically (including speech synthesis), recorded from real world sounds, or both. audio-only a time-based presentation that contains only audio (no video and no interaction) live information captured from a real-world event and transmitted to the receiver with no more than a broadcast delay Note A broadcast delay is a short (usually automated) delay, for example used in order to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient to allow significant editing. Note If information is completely computer generated, it is not live. media alternative for text media that presents no more information than is already presented in text (directly or via text alternatives) Note A media alternative for text is provided for those who benefit from alternate representations of text. Media alternatives for text may be audio-only, video-only (including sign-language video), or audio-video. prerecorded information that is not live video the technology of moving or sequenced pictures or images Note Video can be made up of animated or photographic images, or both. video-only a time-based presentation that contains only video (no audio and no interaction) ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Audio element content has text alternative Video element auditory content has captions Video element visual-only content has accessible alternative ",
            "box": " Success Criterion (SC) For prerecorded audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such: Prerecorded Audio-only An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content. Prerecorded Video-only Either an alternative for time-based media or an audio track is provided that presents equivalent information for prerecorded video-only content. "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G158",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G159",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G166",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F30",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F67"
        ]
    },
    {
        "rule": "wcag:1.1.1",
        "understanding": {
            "brief": " In Brief Goal Non-text information is available to more people. What to do Create a text alternative for visual and auditory content. Why it's important People who can’t fully see or hear content can understand it. ",
            "intent": " Intent The intent of this Success Criterion is to make information conveyed by non-text content accessible through the use of a text alternative. Text alternatives are a primary way for making information accessible because they can be rendered through any sensory modality (for example, visual, auditory or tactile) to match the needs of the user. Providing text alternatives allows the information to be rendered in a variety of ways by a variety of user agents. For example, a person who cannot see a picture can have the text alternative read aloud using synthesized speech. A person who cannot hear an audio file can have the text alternative displayed so that he or she can read it. In the future, text alternatives will also allow information to be more easily translated into sign language or into a simpler form of the same language. Note on CAPTCHA CAPTCHAs are a controversial topic in the accessibility community. As is described in the paper Inaccessibility of CAPTCHA , CAPTCHAs intrinsically push the edges of human abilities in an attempt to defeat automated processes. Every type of CAPTCHA will be unsolvable by users with certain disabilities. However, they are widely used, and the Web Content Accessibility Guidelines Working Group believes that if CAPTCHAs were forbidden outright, Web sites would choose not to conform to WCAG rather than abandon CAPTCHA. This would create barriers for a great many more users with disabilities. For this reason the Working Group has chosen to structure the requirement about CAPTCHA in a way that meets the needs of most people with disabilities, yet is also considered adoptable by sites. Requiring two different forms of CAPTCHA on a given site ensures that most people with disabilities will find a form they can use. Because some users with disabilities will still not be able to access sites that meet the minimum requirements, the Working Group provides recommendations for additional steps. Organizations motivated to conform to WCAG should be aware of the importance of this topic and should go as far beyond the minimum requirements of the guidelines as possible. Additional recommended steps include: Providing more than two modalities of CAPTCHAs Providing access to a human customer service representative who can bypass CAPTCHA Not requiring CAPTCHAs for authorized users Additional information Non-text content can take a number of forms, and this Success Criterion specifies how each is to be handled. For non-text content that is not covered by one of the other situations listed below, such as charts, diagrams, audio recordings, pictures, and animations, text alternatives can make the same information available in a form that can be rendered through any modality (for example, visual, auditory or tactile). Short and long text alternatives can be used as needed to convey the information in the non-text content. Note that prerecorded audio-only and prerecorded video-only files are covered here. Live-audio-only and Live-video-only files are covered below (see 3rd paragraph following this one). For non-text content that is a control or accepts user input , such as images used as submit buttons, image maps or complex animations, a name is provided to describe the purpose of the non-text content so that the person at least knows what the non-text content is and why it is there. Non-text content that is time-based media is made accessible through 1.2: Time-Based Media . However, it is important that users know what it is when they encounter it on a page so they can decide what action if any they want to take with it. A text alternative that describes the time-based media and/or gives its title is therefore provided. For Live Audio-only and live video-only content , it can be much more difficult to provide text alternatives that provide equivalent information as live audio-only and live video-only content. For these types of non-text content, text alternatives provide a descriptive label. Sometimes a test or exercise must be partially or completely presented in non-text format. Audio or visual information is provided that cannot be changed to text because the test or exercise must be conducted using that sense. For example, a hearing test would be invalid if a text alternative were provided. A visual skill development exercise would similarly make no sense in text form. And a spelling test with text alternatives would not be very effective. For these cases, text alternatives should be provided to describe the purpose of the non-text content; of course, the text alternatives would not provide the same information needed to pass the test. Sometimes content is primarily intended to create a specific sensory experience that words cannot fully capture. Examples include a symphony performance, works of visual art etc. For such content, text alternatives at least identify the non-text content with a descriptive label and where possible, additional descriptive text. If the reason for including the content in the page is known and can be described it is helpful to include that information. Sometimes there are non-text exercises that are used to prove you are human. To avoid spam robots and other software from gaining access to a site a device called a CAPTCHA is used. These usually involve visual or auditory tasks that are beyond the current capabilities of Web robots. Providing a text alternative to them would however make them operable by Robots, thus defeating their purpose. In this case a text alternative would describe the purpose of the CAPTCHA, and alternate forms using different modalities would be provided to address the needs of people with different disabilities. Sometimes there is non-text content that really is not meant to be seen or understood by the user. Transparent images used to move text over on a page; an invisible image that is used to track usage statistics; and a swirl in the corner that conveys no information but just fills up a blank space to create an aesthetic effect are all examples of this. Putting alternative text on such items just distracts people using screen readers from the content on the page. Not marking the content in any way, though, leaves users guessing what the non-text content is and what information they may have missed (even though they have not missed anything in reality). This type of non-text content, therefore, is marked or implemented in a way that assistive technologies (AT) will ignore it and not present anything to the user. ",
            "benefits": " Benefits This Success Criterion helps people who have difficulty perceiving visual content. Assistive technology can read text aloud, present it visually, or convert it to braille. Text alternatives may help some people who have difficulty understanding the meaning of photographs, drawings, and other images (e.g., line drawings, graphic designs, paintings, three-dimensional representations), graphs, charts, animations, etc. People who are deaf, are hard of hearing, or who are having trouble understanding audio information for any reason can read the text presentation. Research is ongoing regarding automatic translation of text into sign language. People who are deaf-blind can read the text in braille. Additionally, text alternatives support the ability to search for non-text content and to repurpose content in a variety of ways. ",
            "examples": " Examples A data chart A bar chart compares how many widgets were sold in June, July, and August. The short label says, \"Figure one - Sales in June, July and August.\" The longer description identifies the type of chart, provides a high-level summary of the data, trends and implications comparable to those available from the chart. Where possible and practical, the actual data is provided in a table. An audio recording of a speech The link to an audio clip says, \"Chairman's speech to the assembly.\" A link to a text transcript is provided immediately after the link to the audio clip. An animation that illustrates how a car engine works An animation shows how a car engine works. There is no audio and the animation is part of a tutorial that describes how an engine works. Since the text of the tutorial already provides a full explanation, the image is an alternative for text and the text alternative includes only a brief description of the animation and refers to the tutorial text for more information. A traffic Web camera A Web site allows users to select from a variety of Web cameras positioned throughout a major city. After a camera is selected, the image updates every two minutes. A short text alternative identifies the Web camera as \"traffic Web camera.\" The site also provides a table of travel times for each of the routes covered by the Web cameras. The table is also updated every two minutes. A photograph of an historic event in a news story A photograph of two world leaders shaking hands accompanies a news story about an international summit meeting. The text alternative says, \"President X of Country X shakes hands with Prime Minister Y of country Y.\" A photograph of a historic event in content discussing diplomatic relationships The same image is used in a different context intended to explain nuances in diplomatic encounters. The image of the president shaking hands with the prime minister appears on a Web site discussing intricate diplomatic relationships. The first text alternative reads, \"President X of country X shakes hands with Prime Minister Y of country Y on January 2, 2009.\" An additional text alternative describes the room where the leaders are standing as well as the expressions on the leaders' faces, and identifies the other people in the room. The additional description might be included on the same page as the photograph or in a separate file associated with the image through a link or other standard programmatic mechanism. An audio recording of a press conference A Web page includes a link to an audio recording of a press conference. The link text identifies the audio recording. The page also links to a text transcript of the press conference. The transcript includes a verbatim record of everything the speakers say. It identifies who is speaking as well as noting other significant sounds that are part of the recording, such as applause, laughter, questions from the audience, and so on. An e-learning application An e-learning application uses sound effects to indicate whether or not the answers are correct. The chime sound indicates that the answer is correct and the beep sound indicates that the answer is incorrect. A text description is also included so that people who can't hear or understand the sound understand whether the answer is correct or incorrect. A linked thumbnail image A thumbnail image of the front page of a newspaper links to the home page of the \"Smallville Times\". The text alternative says \"Smallville Times\". The same image used on different sites Different alternatives for an image of the world: An image of the world that is used on a travel site as a link to the International Travel section has the text alternative \"International Travel\". The same image is used as a link on a university Web site with the text alternative \"International Campuses\". An image map An image of a building floor plan is interactive, allowing the user to select a particular room and navigate to a page containing information about that room. The short text alternative describes the image and its interactive purpose: \"Building floor plan. Select a room for more information.\" ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. Excerpts from the NBA Tape Recording Manual, Third Edition Inaccessibility of CAPTCHA All That Malarkey: Accessible Alternatives 456 Berea Street: The Alt and Title Attributes The Alt and Accessibility Better Connected, Better Results: Alt Text ",
            "key-terms": " Key Terms ascii art picture created by a spatial arrangement of characters or glyphs (typically from the 95 printable characters defined by ASCII) assistive technology hardware and/or software that acts as a user agent , or along with a mainstream user agent, to provide functionality to meet the requirements of users with disabilities that go beyond those offered by mainstream user agents Note Functionality provided by assistive technology includes alternative presentations (e.g., as synthesized speech or magnified content), alternative input methods (e.g., voice), additional navigation or orientation mechanisms, and content transformations (e.g., to make tables more accessible). Note Assistive technologies often communicate data and messages with mainstream user agents by using and monitoring APIs. Note The distinction between mainstream user agents and assistive technologies is not absolute. Many mainstream user agents provide some features to assist individuals with disabilities. The basic difference is that mainstream user agents target broad and diverse audiences that usually include people with and without disabilities. Assistive technologies target narrowly defined populations of users with specific disabilities. The assistance provided by an assistive technology is more specific and appropriate to the needs of its target users. The mainstream user agent may provide important functionality to assistive technologies like retrieving Web content from program objects or parsing markup into identifiable bundles. Assistive technologies that are important in the context of this document include the following: screen magnifiers, and other visual reading assistants, which are used by people with visual, perceptual and physical print disabilities to change text font, size, spacing, color, synchronization with speech, etc. in order to improve the visual readability of rendered text and images; screen readers, which are used by people who are blind to read textual information through synthesized speech or braille; text-to-speech software, which is used by some people with cognitive, language, and learning disabilities to convert text into synthetic speech; speech recognition software, which may be used by people who have some physical disabilities; alternative keyboards, which are used by people with certain physical disabilities to simulate the keyboard (including alternate keyboards that use head pointers, single switches, sip/puff and other special input devices.); alternative pointing devices, which are used by people with certain physical disabilities to simulate mouse pointing and button activations. captcha initialism for \"Completely Automated Public Turing test to tell Computers and Humans Apart\" Note CAPTCHA tests often involve asking the user to type in text that is displayed in an obscured image or audio file. Note A Turing test is any system of tests designed to differentiate a human from a computer. It is named after famed computer scientist Alan Turing. The term was coined by researchers at Carnegie Mellon University. content information and sensory experience to be communicated to the user by means of a user agent , including code or markup that defines the content's structure , presentation , and interactions human language language that is spoken, written or signed (through visual or tactile means) to communicate with humans Note See also sign language . label text or other component with a text alternative that is presented to a user to identify a component within Web content Note A label is presented to all users whereas the name may be hidden and only exposed by assistive technology. In many (but not all) cases the name and the label are the same. Note The term label is not limited to the label element in HTML. name text by which software can identify a component within Web content to the user Note The name may be hidden and only exposed by assistive technology, whereas a label is presented to all users. In many (but not all) cases, the label and the name are the same. Note This is unrelated to the name attribute in HTML. non-text content any content that is not a sequence of characters that can be programmatically determined or where the sequence is not expressing something in human language Note This includes ASCII Art (which is a pattern of characters), emoticons, leetspeak (which uses character substitution), and images representing text presentation rendering of the content in a form to be perceived by users programmatically determined determined by software from author-supplied data provided in a way that different user agents , including assistive technologies , can extract and present this information to users in different modalities Determined in a markup language from elements and attributes that are accessed directly by commonly available assistive technology. Determined from technology-specific data structures in a non-markup language and exposed to assistive technology via an accessibility API that is supported by commonly available assistive technology. pure decoration serving only an aesthetic purpose, providing no information, and having no functionality Note Text is only purely decorative if the words can be rearranged or substituted without changing their purpose. The cover page of a dictionary has random words in very light text in the background. sign language a language using combinations of movements of the hands and arms, facial expressions, or body positions to convey meaning specific sensory experience a sensory experience that is not purely decorative and does not primarily convey important information or perform a function Examples include a performance of a flute solo, works of visual art etc. structure The way the parts of a Web page are organized in relation to each other; and The way a collection of Web pages is organized text sequence of characters that can be programmatically determined , where the sequence is expressing something in human language text alternative Text that is programmatically associated with non-text content or referred to from text that is programmatically associated with non-text content. Programmatically associated text is text whose location can be programmatically determined from the non-text content. An image of a chart is described in text in the paragraph after the chart. The short text alternative for the chart indicates that a description follows. Note Refer to Understanding Text Alternatives for more information. user agent any software that retrieves and presents Web content for users Web browsers, media players, plug-ins, and other programs — including assistive technologies — that help in retrieving, rendering, and interacting with Web content. web page a non-embedded resource obtained from a single URI using HTTP plus any other resources that are used in the rendering or intended to be rendered together with it by a user agent Note Although any \"other resources\" would be rendered together with the primary resource, they would not necessarily be rendered simultaneously with each other. Note For the purposes of conformance with these guidelines, a resource must be \"non-embedded\" within the scope of conformance to be considered a Web page. A Web resource including all embedded images and media. A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program lives entirely at http://example.com/mail, but includes an inbox, a contacts area and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar to display, but do not change the URI of the page as a whole. A customizable portal site, where users can choose content to display from a set of different content modules. When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like interactive shopping environment where you visually move around in a store dragging products off of the shelves around you and into a visual shopping cart in front of you. Clicking on a product causes it to be demonstrated with a specification sheet floating alongside. This might be a single-page Web site or just one page within a Web site. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Image accessible name is descriptive Image button has non-empty accessible name Image has non-empty accessible name Link has non-empty accessible name Object element rendering non-text content has non-empty accessible name SVG element with explicit role has non-empty accessible name Image filename is accessible name for image Image not in the accessibility tree is decorative ",
            "box": " Success Criterion (SC) All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below. Controls, Input If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.) Time-Based Media If non-text content is time-based media, then text alternatives at least provide descriptive identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.) Test If non-text content is a test or exercise that would be invalid if presented in text , then text alternatives at least provide descriptive identification of the non-text content. Sensory If non-text content is primarily intended to create a specific sensory experience , then text alternatives at least provide descriptive identification of the non-text content. CAPTCHA If the purpose of non-text content is to confirm that content is being accessed by a person rather than a computer, then text alternatives that identify and describe the purpose of the non-text content are provided, and alternative forms of CAPTCHA using output modes for different types of sensory perception are provided to accommodate different disabilities. Decoration, Formatting, Invisible If non-text content is pure decoration , is used only for visual formatting, or is not presented to users, then it is implemented in a way that it can be ignored by assistive technology . "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G94",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G95",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques//H35",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA15",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G73",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G74",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G92",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G82",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA9",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H24",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H30",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H36",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H44",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H65",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G68",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G100",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA6",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA10",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G196",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H2",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H37",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H86",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF1",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G143",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G144",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C9",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H67",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF4",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C18",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F3",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F13",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F20",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F30",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F38",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F39",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F65",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F67",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F71",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F72"
        ]
    },
    {
        "rule": "wcag:1.2.2",
        "understanding": {
            "brief": " In Brief Goal Videos can be played with captions. What to do Provide synchronized text for audio content in existing videos. Why it's important People who are deaf or hard of hearing can understand audio in videos. ",
            "intent": " Intent The intent of this Success Criterion is to enable people who are deaf or hard of hearing to watch synchronized media presentations. Captions provide the part of the content available via the audio track. Captions not only include dialogue, but identify who is speaking and include non-speech information conveyed through sound, including meaningful sound effects. It is acknowledged that at the present time there may be difficulty in creating captions for time-sensitive material and this may result in the author being faced with the choice of delaying the information until captions are available, or publishing time-sensitive content that is inaccessible to the deaf, at least for the interval until captions are available. Over time, the tools for captioning as well as building the captioning into the delivery process can shorten or eliminate such delays. Captions are not needed when the synchronized media is, itself, an alternate presentation of information that is also presented via text on the Web page. For example, if information on a page is accompanied by a synchronized media presentation that presents no more information than is already presented in text, but is easier for people with cognitive, language, or learning disabilities to understand, then it would not need to be captioned since the information is already presented on the page in text or in text alternatives (e.g., for images). See also 1.2.4: Captions (Live) . ",
            "benefits": " Benefits People who are deaf or have a hearing loss can access the auditory information in the synchronized media content through captions. ",
            "examples": " Examples A captioned tutorial A video clip shows how to tie a knot. The captions read, \"(music) Using rope to tie knots was an important skill for the likes of sailors, soldiers and woodsmen..\" From Sample Transcript Formatting by Whit Anderson. A complex legal document contains synchronized media clips for different paragraphs that show a person speaking the contents of the paragraph. Each clip is associated with its corresponding paragraph. No captions are provided for the synchronized media. An instruction manual containing a description of a part and its necessary orientation is accompanied by a synchronized media clip showing the part in its correct orientation. No captions are provided for the synchronized media clip. An orchestra provides captions for videos of performances. In addition to capturing dialog and lyrics verbatim, captions identify non-vocal music by title, movement, composer, and any information that will help the user comprehend the nature of the audio. For instance captions read, \"[Orchestral Suite No. 3.2 in D major, BWV 1068, Air] [Johann Sebastian Bach, Composer] ♪ Calm melody with a slow tempo ♪\" Note Style guides for captions may differ among different languages. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. Guides to Captioning BBC: Subtitle Guidelines Captioning Key: Guidelines and Preferred Techniques Best Practices in Online Captioning SMIL Resources Synchronized Multimedia Integration Language (SMIL) 3.0 Accessibility Features of SMIL Other Captioning Resources National Center for Accessible Media WebAIM: Captioning Resource List ",
            "key-terms": " Key Terms ascii art picture created by a spatial arrangement of characters or glyphs (typically from the 95 printable characters defined by ASCII) assistive technology hardware and/or software that acts as a user agent , or along with a mainstream user agent, to provide functionality to meet the requirements of users with disabilities that go beyond those offered by mainstream user agents Note Functionality provided by assistive technology includes alternative presentations (e.g., as synthesized speech or magnified content), alternative input methods (e.g., voice), additional navigation or orientation mechanisms, and content transformations (e.g., to make tables more accessible). Note Assistive technologies often communicate data and messages with mainstream user agents by using and monitoring APIs. Note The distinction between mainstream user agents and assistive technologies is not absolute. Many mainstream user agents provide some features to assist individuals with disabilities. The basic difference is that mainstream user agents target broad and diverse audiences that usually include people with and without disabilities. Assistive technologies target narrowly defined populations of users with specific disabilities. The assistance provided by an assistive technology is more specific and appropriate to the needs of its target users. The mainstream user agent may provide important functionality to assistive technologies like retrieving Web content from program objects or parsing markup into identifiable bundles. Assistive technologies that are important in the context of this document include the following: screen magnifiers, and other visual reading assistants, which are used by people with visual, perceptual and physical print disabilities to change text font, size, spacing, color, synchronization with speech, etc. in order to improve the visual readability of rendered text and images; screen readers, which are used by people who are blind to read textual information through synthesized speech or braille; text-to-speech software, which is used by some people with cognitive, language, and learning disabilities to convert text into synthetic speech; speech recognition software, which may be used by people who have some physical disabilities; alternative keyboards, which are used by people with certain physical disabilities to simulate the keyboard (including alternate keyboards that use head pointers, single switches, sip/puff and other special input devices.); alternative pointing devices, which are used by people with certain physical disabilities to simulate mouse pointing and button activations. audio the technology of sound reproduction Note Audio can be created synthetically (including speech synthesis), recorded from real world sounds, or both. audio description narration added to the soundtrack to describe important visual details that cannot be understood from the main soundtrack alone Note Audio description of video provides information about actions, characters, scene changes, on-screen text, and other visual content. Note In standard audio description, narration is added during existing pauses in dialogue. (See also extended audio description .) Note Where all of the video information is already provided in existing audio , no additional audio description is necessary. Note Also called \"video description\" and \"descriptive narration.\" captions synchronized visual and/or text alternative for both speech and non-speech audio information needed to understand the media content Note Captions are similar to dialogue-only subtitles except captions convey not only the content of spoken dialogue, but also equivalents for non-dialogue audio information needed to understand the program content, including sound effects, music, laughter, speaker identification and location. Note Closed Captions are equivalents that can be turned on and off with some players. Note Open Captions are any captions that cannot be turned off. For example, if the captions are visual equivalent images of text embedded in video . Note Captions should not obscure or obstruct relevant information in the video. Note In some countries, captions are called subtitles. Note Audio descriptions can be, but do not need to be, captioned since they are descriptions of information that is already presented visually. extended audio description audio description that is added to an audiovisual presentation by pausing the video so that there is time to add additional description Note This technique is only used when the sense of the video would be lost without the additional audio description and the pauses between dialogue/narration are too short. human language language that is spoken, written or signed (through visual or tactile means) to communicate with humans Note See also sign language . image of text text that has been rendered in a non-text form (e.g., an image) in order to achieve a particular visual effect Note This does not include text that is part of a picture that contains significant other visual content. A person's name on a nametag in a photograph. live information captured from a real-world event and transmitted to the receiver with no more than a broadcast delay Note A broadcast delay is a short (usually automated) delay, for example used in order to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient to allow significant editing. Note If information is completely computer generated, it is not live. media alternative for text media that presents no more information than is already presented in text (directly or via text alternatives) Note A media alternative for text is provided for those who benefit from alternate representations of text. Media alternatives for text may be audio-only, video-only (including sign-language video), or audio-video. non-text content any content that is not a sequence of characters that can be programmatically determined or where the sequence is not expressing something in human language Note This includes ASCII Art (which is a pattern of characters), emoticons, leetspeak (which uses character substitution), and images representing text prerecorded information that is not live programmatically determined determined by software from author-supplied data provided in a way that different user agents , including assistive technologies , can extract and present this information to users in different modalities Determined in a markup language from elements and attributes that are accessed directly by commonly available assistive technology. Determined from technology-specific data structures in a non-markup language and exposed to assistive technology via an accessibility API that is supported by commonly available assistive technology. sign language a language using combinations of movements of the hands and arms, facial expressions, or body positions to convey meaning synchronized media audio or video synchronized with another format for presenting information and/or with time-based interactive components, unless the media is a media alternative for text that is clearly labeled as such text sequence of characters that can be programmatically determined , where the sequence is expressing something in human language text alternative Text that is programmatically associated with non-text content or referred to from text that is programmatically associated with non-text content. Programmatically associated text is text whose location can be programmatically determined from the non-text content. An image of a chart is described in text in the paragraph after the chart. The short text alternative for the chart indicates that a description follows. Note Refer to Understanding Text Alternatives for more information. user agent any software that retrieves and presents Web content for users Web browsers, media players, plug-ins, and other programs — including assistive technologies — that help in retrieving, rendering, and interacting with Web content. video the technology of moving or sequenced pictures or images Note Video can be made up of animated or photographic images, or both. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Video element auditory content has accessible alternative ",
            "box": " Success Criterion (SC) Captions are provided for all prerecorded audio content in synchronized media , except when the media is a media alternative for text and is clearly labeled as such. "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G93",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM11",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM12",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H95",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F8",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F75",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F74"
        ]
    },
    {
        "rule": "wcag:1.2.3",
        "understanding": {
            "brief": " In Brief Goal Prerecorded videos can be understood by more people. What to do Provide a description of the visual content in videos. Why it's important People who are blind or who cannot understand the visual content can have it described. ",
            "intent": " Intent The intent of this Success Criterion is to provide people who are blind or visually impaired access to the visual information in a synchronized media presentation. This Success Criterion describes two approaches, either of which can be used. One approach is to provide audio description of the video content. The audio description augments the audio portion of the presentation with the information needed when the video portion is not available. During existing pauses in dialogue, audio description provides information about actions, characters, scene changes, and on-screen text that are important and are not described or spoken in the main sound track. The second approach involves providing all of the information in the synchronized media (both visual and auditory) in text form. An alternative for time-based media provides a running description of all that is going on in the synchronized media content. The alternative for time-based media reads something like a screenplay or book. Unlike audio description, the description of the video portion is not constrained to just the pauses in the existing dialogue. Full descriptions are provided of all visual information, including visual context, actions and expressions of actors, and any other visual material. In addition, non-speech sounds (laughter, off-screen voices, etc.) are described, and transcripts of all dialogue are included. The sequence of description and dialogue transcripts are the same as the sequence in the synchronized media itself. As a result, the alternative for time-based media can provide a much more complete representation of the synchronized media content than audio description alone. If there is any interaction as part of the synchronized media presentation (e.g., \"press now to answer the question\") then the alternative for time-based media would provide hyperlinks or whatever is needed to provide the same functionality. Note For 1.2.3, 1.2.5, and 1.2.7, if all of the information in the video track is already provided in the audio track, no audio description is necessary. 1.2.3, 1.2.5, and 1.2.8 overlap somewhat with each other. This is to give the author some choice at the minimum conformance level, and to provide additional requirements at higher levels. At Level A in Success Criterion 1.2.3, authors do have the choice of providing either an audio description or a full text alternative. If they wish to conform at Level AA, under Success Criterion 1.2.5 authors must provide an audio description - a requirement already met if they chose that alternative for 1.2.3, otherwise an additional requirement. At Level AAA under Success Criterion 1.2.8 they must provide an extended text description. This is an additional requirement if both 1.2.3 and 1.2.5 were met by providing an audio description only. If 1.2.3 was met, however, by providing a text description, and the 1.2.5 requirement for an audio description was met, then 1.2.8 does not add new requirements. See also 1.2.5 Audio Description (Prerecorded) , 1.2.7 Extended Audio Description (Prerecorded) and 1.2.8 Media Alternative (Prerecorded) . ",
            "benefits": " Benefits This Success Criterion may help some people who have difficulty watching video or other synchronized media content, including people who have difficulty perceiving or understanding moving images. ",
            "examples": " Examples A movie with audio description Describer: A title, \"Teaching Evolution Case Studies. Bonnie Chen.\" A teacher shows photographs of birds with long, thin beaks. Bonnie Chen: \"These photos were all taken at the Everglades.\" Describer: The teacher hands each student two flat, thin wooden sticks. Bonnie Chen: \"Today you will pretend to be a species of wading bird that has a beak like this.\" Describer: The teacher holds two of the sticks to her mouth making the shape of a beak. Transcript of audio based on the first few minutes of \" Teaching Evolution Case Studies, Bonnie Chen \" (copyright WGBH and Clear Blue Sky Productions, Inc.) An alternative for time-based media for a training video A company purchases a Training video for use by its employees and puts it on the companies intranet. The video involves explaining use of a new technology and has a person talking and showing things at the same time. Since there is no place to insert audio description of the visual demonstrations during gaps in dialogue, the company provides an alternative for time-based media that all employees, including those who cannot see the demonstrations, can use to better understand what is being presented. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. NCAM Rich Media Accessibility, Accessible SMIL Templates Standard Techniques in Audio Description Synchronized Multimedia Integration Language (SMIL) 1.0 Synchronized Multimedia Integration Language (SMIL 2.0) Accessibility Features of SMIL ",
            "key-terms": " Key Terms alternative for time-based media document including correctly sequenced text descriptions of time-based visual and auditory information and providing a means for achieving the outcomes of any time-based interaction Note A screenplay used to create the synchronized media content would meet this definition only if it was corrected to accurately represent the final synchronized media after editing. audio the technology of sound reproduction Note Audio can be created synthetically (including speech synthesis), recorded from real world sounds, or both. audio description narration added to the soundtrack to describe important visual details that cannot be understood from the main soundtrack alone Note Audio description of video provides information about actions, characters, scene changes, on-screen text, and other visual content. Note In standard audio description, narration is added during existing pauses in dialogue. (See also extended audio description .) Note Where all of the video information is already provided in existing audio , no additional audio description is necessary. Note Also called \"video description\" and \"descriptive narration.\" extended audio description audio description that is added to an audiovisual presentation by pausing the video so that there is time to add additional description Note This technique is only used when the sense of the video would be lost without the additional audio description and the pauses between dialogue/narration are too short. live information captured from a real-world event and transmitted to the receiver with no more than a broadcast delay Note A broadcast delay is a short (usually automated) delay, for example used in order to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient to allow significant editing. Note If information is completely computer generated, it is not live. media alternative for text media that presents no more information than is already presented in text (directly or via text alternatives) Note A media alternative for text is provided for those who benefit from alternate representations of text. Media alternatives for text may be audio-only, video-only (including sign-language video), or audio-video. prerecorded information that is not live synchronized media audio or video synchronized with another format for presenting information and/or with time-based interactive components, unless the media is a media alternative for text that is clearly labeled as such video the technology of moving or sequenced pictures or images Note Video can be made up of animated or photographic images, or both. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Video element visual content has accessible alternative ",
            "box": " Success Criterion (SC) An alternative for time-based media or audio description of the prerecorded video content is provided for synchronized media , except when the media is a media alternative for text and is clearly labeled as such. "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G69",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G58",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H53",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G78",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G173",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM6",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM7",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G8",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM1",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G203",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96"
        ]
    },
    {
        "rule": "wcag:1.2.4",
        "understanding": {
            "brief": " In Brief Goal Live videos have captions. What to do Provide synchronized text for audio content in real-time videos. Why it's important People who are deaf or hard of hearing can understand audio in real-time video content. ",
            "intent": " Intent The intent of this Success Criterion is to enable people who are deaf or hard of hearing to watch real-time presentations. Captions provide the part of the content available via the audio track. Captions not only include dialogue, but also identify who is speaking and notate sound effects and other significant audio. This success criterion was intended to apply to broadcast of synchronized media and is not intended to require that two-way multimedia calls between two or more individuals through web apps must be captioned regardless of the needs of users. Responsibility for providing captions would fall to the content providers (the callers) or the “host” caller, and not the application. ",
            "benefits": " Benefits People who are deaf or have a hearing loss can access the auditory information in the synchronized media content through captions. ",
            "examples": " Examples A Web cast A news organization provides a live, captioned Web cast. A music Web cast An orchestra provides Communication Access Realtime Translation (CART) captioning of each real-time Web performance. The CART service captures lyrics and dialog as well as identifies non-vocal music by title, movement, composer, and any information that will help the user comprehend the nature of the audio. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. See 1.2.2: Captions (Prerecorded) . ",
            "key-terms": " Key Terms ascii art picture created by a spatial arrangement of characters or glyphs (typically from the 95 printable characters defined by ASCII) assistive technology hardware and/or software that acts as a user agent , or along with a mainstream user agent, to provide functionality to meet the requirements of users with disabilities that go beyond those offered by mainstream user agents Note Functionality provided by assistive technology includes alternative presentations (e.g., as synthesized speech or magnified content), alternative input methods (e.g., voice), additional navigation or orientation mechanisms, and content transformations (e.g., to make tables more accessible). Note Assistive technologies often communicate data and messages with mainstream user agents by using and monitoring APIs. Note The distinction between mainstream user agents and assistive technologies is not absolute. Many mainstream user agents provide some features to assist individuals with disabilities. The basic difference is that mainstream user agents target broad and diverse audiences that usually include people with and without disabilities. Assistive technologies target narrowly defined populations of users with specific disabilities. The assistance provided by an assistive technology is more specific and appropriate to the needs of its target users. The mainstream user agent may provide important functionality to assistive technologies like retrieving Web content from program objects or parsing markup into identifiable bundles. Assistive technologies that are important in the context of this document include the following: screen magnifiers, and other visual reading assistants, which are used by people with visual, perceptual and physical print disabilities to change text font, size, spacing, color, synchronization with speech, etc. in order to improve the visual readability of rendered text and images; screen readers, which are used by people who are blind to read textual information through synthesized speech or braille; text-to-speech software, which is used by some people with cognitive, language, and learning disabilities to convert text into synthetic speech; speech recognition software, which may be used by people who have some physical disabilities; alternative keyboards, which are used by people with certain physical disabilities to simulate the keyboard (including alternate keyboards that use head pointers, single switches, sip/puff and other special input devices.); alternative pointing devices, which are used by people with certain physical disabilities to simulate mouse pointing and button activations. audio the technology of sound reproduction Note Audio can be created synthetically (including speech synthesis), recorded from real world sounds, or both. audio description narration added to the soundtrack to describe important visual details that cannot be understood from the main soundtrack alone Note Audio description of video provides information about actions, characters, scene changes, on-screen text, and other visual content. Note In standard audio description, narration is added during existing pauses in dialogue. (See also extended audio description .) Note Where all of the video information is already provided in existing audio , no additional audio description is necessary. Note Also called \"video description\" and \"descriptive narration.\" captions synchronized visual and/or text alternative for both speech and non-speech audio information needed to understand the media content Note Captions are similar to dialogue-only subtitles except captions convey not only the content of spoken dialogue, but also equivalents for non-dialogue audio information needed to understand the program content, including sound effects, music, laughter, speaker identification and location. Note Closed Captions are equivalents that can be turned on and off with some players. Note Open Captions are any captions that cannot be turned off. For example, if the captions are visual equivalent images of text embedded in video . Note Captions should not obscure or obstruct relevant information in the video. Note In some countries, captions are called subtitles. Note Audio descriptions can be, but do not need to be, captioned since they are descriptions of information that is already presented visually. extended audio description audio description that is added to an audiovisual presentation by pausing the video so that there is time to add additional description Note This technique is only used when the sense of the video would be lost without the additional audio description and the pauses between dialogue/narration are too short. human language language that is spoken, written or signed (through visual or tactile means) to communicate with humans Note See also sign language . image of text text that has been rendered in a non-text form (e.g., an image) in order to achieve a particular visual effect Note This does not include text that is part of a picture that contains significant other visual content. A person's name on a nametag in a photograph. live information captured from a real-world event and transmitted to the receiver with no more than a broadcast delay Note A broadcast delay is a short (usually automated) delay, for example used in order to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient to allow significant editing. Note If information is completely computer generated, it is not live. media alternative for text media that presents no more information than is already presented in text (directly or via text alternatives) Note A media alternative for text is provided for those who benefit from alternate representations of text. Media alternatives for text may be audio-only, video-only (including sign-language video), or audio-video. non-text content any content that is not a sequence of characters that can be programmatically determined or where the sequence is not expressing something in human language Note This includes ASCII Art (which is a pattern of characters), emoticons, leetspeak (which uses character substitution), and images representing text programmatically determined determined by software from author-supplied data provided in a way that different user agents , including assistive technologies , can extract and present this information to users in different modalities Determined in a markup language from elements and attributes that are accessed directly by commonly available assistive technology. Determined from technology-specific data structures in a non-markup language and exposed to assistive technology via an accessibility API that is supported by commonly available assistive technology. sign language a language using combinations of movements of the hands and arms, facial expressions, or body positions to convey meaning synchronized media audio or video synchronized with another format for presenting information and/or with time-based interactive components, unless the media is a media alternative for text that is clearly labeled as such text sequence of characters that can be programmatically determined , where the sequence is expressing something in human language text alternative Text that is programmatically associated with non-text content or referred to from text that is programmatically associated with non-text content. Programmatically associated text is text whose location can be programmatically determined from the non-text content. An image of a chart is described in text in the paragraph after the chart. The short text alternative for the chart indicates that a description follows. Note Refer to Understanding Text Alternatives for more information. user agent any software that retrieves and presents Web content for users Web browsers, media players, plug-ins, and other programs — including assistive technologies — that help in retrieving, rendering, and interacting with Web content. video the technology of moving or sequenced pictures or images Note Video can be made up of animated or photographic images, or both. ",
            "box": " Success Criterion (SC) Captions are provided for all live audio content in synchronized media . "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G93",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G9",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G87",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM11",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM12"
        ]
    },
    {
        "rule": "wcag:1.2.5",
        "understanding": {
            "brief": " In Brief Goal Videos can be played with audio descriptions. What to do Provide a synchronized spoken description of the visual content in videos. Why it's important People who cannot see or understand the visual content can hear about it while playing videos. ",
            "intent": " Intent The intent of this Success Criterion is to provide people who are blind or visually impaired access to the visual information in a synchronized media presentation. The audio description augments the audio portion of the presentation with the information needed when the video portion is not available. During existing pauses in dialogue, audio description provides information about actions, characters, scene changes, and on-screen text that are important and are not described or spoken in the main sound track. Note For 1.2.3, 1.2.5, and 1.2.7, if all of the information in the video track is already provided in the audio track, no audio description is necessary. 1.2.3, 1.2.5, and 1.2.8 overlap somewhat with each other. This is to give the author some choice at the minimum conformance level, and to provide additional requirements at higher levels. At Level A in Success Criterion 1.2.3, authors do have the choice of providing either an audio description or a full text alternative. If they wish to conform at Level AA, under Success Criterion 1.2.5 authors must provide an audio description - a requirement already met if they chose that alternative for 1.2.3, otherwise an additional requirement. At Level AAA under Success Criterion 1.2.8 they must provide an extended text description. This is an additional requirement if both 1.2.3 and 1.2.5 were met by providing an audio description only. If 1.2.3 was met, however, by providing a text description, and the 1.2.5 requirement for an audio description was met, then 1.2.8 does not add new requirements. ",
            "benefits": " Benefits People who are blind or have low vision as well as those with cognitive limitations who have difficulty interpreting visually what is happening benefit from audio description of visual information. ",
            "examples": " Examples A movie with audio description Describer: A title, \"Teaching Evolution Case Studies. Bonnie Chen.\" A teacher shows photographs of birds with long, thin beaks. Bonnie Chen: \"These photos were all taken at the Everglades.\" Describer: The teacher hands each student two flat, thin wooden sticks. Bonnie Chen: \"Today you will pretend to be a species of wading bird that has a beak like this.\" Describer: The teacher holds two of the sticks to her mouth making the shape of a beak. Transcript of audio based on the first few minutes of \" Teaching Evolution Case Studies, Bonnie Chen \" (copyright WGBH and Clear Blue Sky Productions, Inc.) ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. NCAM Rich Media Accessibility, Accessible SMIL Templates Standard Techniques in Audio Description Synchronized Multimedia Integration Language (SMIL) 1.0 Synchronized Multimedia Integration Language (SMIL 2.0) Accessibility Features of SMIL ",
            "key-terms": " Key Terms audio the technology of sound reproduction Note Audio can be created synthetically (including speech synthesis), recorded from real world sounds, or both. audio description narration added to the soundtrack to describe important visual details that cannot be understood from the main soundtrack alone Note Audio description of video provides information about actions, characters, scene changes, on-screen text, and other visual content. Note In standard audio description, narration is added during existing pauses in dialogue. (See also extended audio description .) Note Where all of the video information is already provided in existing audio , no additional audio description is necessary. Note Also called \"video description\" and \"descriptive narration.\" extended audio description audio description that is added to an audiovisual presentation by pausing the video so that there is time to add additional description Note This technique is only used when the sense of the video would be lost without the additional audio description and the pauses between dialogue/narration are too short. live information captured from a real-world event and transmitted to the receiver with no more than a broadcast delay Note A broadcast delay is a short (usually automated) delay, for example used in order to give the broadcaster time to cue or censor the audio (or video) feed, but not sufficient to allow significant editing. Note If information is completely computer generated, it is not live. media alternative for text media that presents no more information than is already presented in text (directly or via text alternatives) Note A media alternative for text is provided for those who benefit from alternate representations of text. Media alternatives for text may be audio-only, video-only (including sign-language video), or audio-video. prerecorded information that is not live synchronized media audio or video synchronized with another format for presenting information and/or with time-based interactive components, unless the media is a media alternative for text that is clearly labeled as such video the technology of moving or sequenced pictures or images Note Video can be made up of animated or photographic images, or both. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Video element visual content has accessible alternative Video element visual content has strict accessible alternative ",
            "box": " Success Criterion (SC) Audio description is provided for all prerecorded video content in synchronized media . "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G78",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G173",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM6",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM7",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G8",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM1",
            "https://www.w3.org/WAI/WCAG22/Techniques/smil/SM2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G203",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H96"
        ]
    },
    {
        "rule": "wcag:1.3.1",
        "understanding": {
            "brief": " In Brief Goal Information about content structure is available to more people. What to do Use code to reinforce relationships and information conveyed through presentation. Why it's important People can adapt the presentation to suit their needs while preserving the original meaning. ",
            "intent": " Intent The intent of this Success Criterion is to ensure that information and relationships that are implied by visual or auditory formatting are preserved when the presentation format changes. For example, the presentation format changes when the content is read by a screen reader or when a user style sheet is substituted for the style sheet provided by the author. \t\t\t\t\t\tSighted users perceive structure and relationships through various visual cues — headings are often in a larger, bold font separated from paragraphs by blank lines; list items are preceded by a bullet and perhaps indented; paragraphs are separated by a blank line; items that share a common characteristic are organized into tabular rows and columns; form fields may be positioned as groups that share text labels; a different background color may be used to indicate that several items are related to each other; words that have special status are indicated by changing the font family and /or bolding, italicizing, or underlining them; items that share a common characteristic are organized into a table where the relationship of cells sharing the same row or column and the relationship of each cell to its row and/or column header are necessary for understanding; and so on. Having these structures and these relationships programmatically determined or available in text ensures that information important for comprehension will be perceivable to all. Auditory cues may be used as well. For example, a chime might indicate the beginning of a new section; a change in voice pitch or speech rate may be used to emphasize important information or to indicate quoted text; etc. When such relationships are perceivable to one set of users, those relationships can be made to be perceivable to all. One method of determining whether or not information has been properly provided to all users is to access the information serially in different modalities. If links to glossary items are implemented using anchor elements (or the proper link element for the technology in use) and identified using a different font face, a screen reader user will hear that the item is a link when the glossary term is encountered even though they may not receive information about the change in font face. An on-line catalog may indicate prices using a larger font colored red. A screen reader or person who cannot perceive red, still has the information about the price as long as it is preceded by the currency symbol. Some technologies do not provide a means to programmatically determine some types of information and relationships. In that case then there should be a text description of the information and relationships. For instance, \"all required fields are marked with an asterisk (*)\". The text description should be near the information it is describing (when the page is linearized), such as in the parent element or in the adjacent element. There may also be cases where it may be a judgment call as to whether the relationships should be programmatically determined or be presented in text. However, when technologies support programmatic relationships, it is strongly encouraged that information and relationships be programmatically determined rather than described in text. Note It is not required that color values be programmatically determined. The information conveyed by color cannot be adequately presented simply by exposing the value. Therefore, Success Criterion 1.4.1 addresses the specific case of color, rather than Success Criterion 1.3.1. ",
            "benefits": " Benefits This Success Criterion helps people with different disabilities by allowing user agents to adapt content according to the needs of individual users. Users who are blind (using a screen reader) benefit when information conveyed through color is also available in text (including text alternatives for images that use color to convey information). Users who are deaf-blind using braille (text) refreshable displays may be unable to access color-dependent information. ",
            "examples": " Examples A form with required fields A form contains several required fields. The labels for the required fields are displayed in red. In addition, at the end of each label is an asterisk character, *. The instructions for completing the form indicate that \"all required fields are displayed in red and marked with an asterisk *\", followed by an example. A form that uses color and text to indicate required fields A form contains both required and optional fields. Instructions at the top of the form explain that required fields are labeled with red text and also with an icon whose text alternative says, \"Required.\" Both the red text and the icon are programmatically associated with the appropriate form fields so that assistive technology users can determine the required fields. A bus schedule table where the headers for each cell can be programmatically determined A bus schedule consists of a table with the bus stops listed vertically in the first column and the different buses listed horizontally across the first row. Each cell contains the time when the bus will be at that bus stop. The bus stop and bus cells are identified as headers for their corresponding row or column so that assistive technology can programmatically determine which bus and which bus stop are associated with the time in each cell. A form where the labels for the checkboxes can be programmatically determined In a form, the labels for each checkbox can be programmatically determined by assistive technology. A text document A simple text document is formatted with double blank lines before titles, asterisks to indicate list items and other standard formatting conventions so that its structure can be programmatically determined. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. WebAIM: Semantic Structure Heading Tags ",
            "key-terms": " Key Terms assistive technology hardware and/or software that acts as a user agent , or along with a mainstream user agent, to provide functionality to meet the requirements of users with disabilities that go beyond those offered by mainstream user agents Note Functionality provided by assistive technology includes alternative presentations (e.g., as synthesized speech or magnified content), alternative input methods (e.g., voice), additional navigation or orientation mechanisms, and content transformations (e.g., to make tables more accessible). Note Assistive technologies often communicate data and messages with mainstream user agents by using and monitoring APIs. Note The distinction between mainstream user agents and assistive technologies is not absolute. Many mainstream user agents provide some features to assist individuals with disabilities. The basic difference is that mainstream user agents target broad and diverse audiences that usually include people with and without disabilities. Assistive technologies target narrowly defined populations of users with specific disabilities. The assistance provided by an assistive technology is more specific and appropriate to the needs of its target users. The mainstream user agent may provide important functionality to assistive technologies like retrieving Web content from program objects or parsing markup into identifiable bundles. Assistive technologies that are important in the context of this document include the following: screen magnifiers, and other visual reading assistants, which are used by people with visual, perceptual and physical print disabilities to change text font, size, spacing, color, synchronization with speech, etc. in order to improve the visual readability of rendered text and images; screen readers, which are used by people who are blind to read textual information through synthesized speech or braille; text-to-speech software, which is used by some people with cognitive, language, and learning disabilities to convert text into synthetic speech; speech recognition software, which may be used by people who have some physical disabilities; alternative keyboards, which are used by people with certain physical disabilities to simulate the keyboard (including alternate keyboards that use head pointers, single switches, sip/puff and other special input devices.); alternative pointing devices, which are used by people with certain physical disabilities to simulate mouse pointing and button activations. content information and sensory experience to be communicated to the user by means of a user agent , including code or markup that defines the content's structure , presentation , and interactions presentation rendering of the content in a form to be perceived by users programmatically determined determined by software from author-supplied data provided in a way that different user agents , including assistive technologies , can extract and present this information to users in different modalities Determined in a markup language from elements and attributes that are accessed directly by commonly available assistive technology. Determined from technology-specific data structures in a non-markup language and exposed to assistive technology via an accessibility API that is supported by commonly available assistive technology. relationships meaningful associations between distinct pieces of content structure The way the parts of a Web page are organized in relation to each other; and The way a collection of Web pages is organized user agent any software that retrieves and presents Web content for users Web browsers, media players, plug-ins, and other programs — including assistive technologies — that help in retrieving, rendering, and interacting with Web content. web page a non-embedded resource obtained from a single URI using HTTP plus any other resources that are used in the rendering or intended to be rendered together with it by a user agent Note Although any \"other resources\" would be rendered together with the primary resource, they would not necessarily be rendered simultaneously with each other. Note For the purposes of conformance with these guidelines, a resource must be \"non-embedded\" within the scope of conformance to be considered a Web page. A Web resource including all embedded images and media. A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program lives entirely at http://example.com/mail, but includes an inbox, a contacts area and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar to display, but do not change the URI of the page as a whole. A customizable portal site, where users can choose content to display from a set of different content modules. When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like interactive shopping environment where you visually move around in a store dragging products off of the shelves around you and into a visual shopping cart in front of you. Clicking on a product causes it to be demonstrated with a specification sheet floating alongside. This might be a single-page Web site or just one page within a Web site. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . ARIA attribute is defined in WAI-ARIA ARIA state or property has valid value Headers attribute specified on a cell refers to cells in the same table element Role attribute has valid value ARIA required context role ARIA required ID references exist ARIA required owned elements ARIA state or property is permitted Element with role attribute has required states and properties Table header cell has assigned cells ",
            "box": " Success Criterion (SC) Information, structure , and relationships conveyed through presentation can be programmatically determined or are available in text. "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA11",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H101",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA12",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA13",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA16",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA17",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA20",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G115",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H49",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G117",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G140",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA24",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G138",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H51",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF6",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF20",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H39",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H63",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H43",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H44",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H65",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF10",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF12",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H71",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H85",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H48",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H42",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF9",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF11",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF17",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF21",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H97",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G117",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T1",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T2",
            "https://www.w3.org/WAI/WCAG22/Techniques/text/T3",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C22",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G162",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA1",
            "https://www.w3.org/WAI/WCAG22/Techniques/aria/ARIA2",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G141",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F2",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F33",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F34",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F42",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F43",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F46",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F48",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F87",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F90",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F91",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F92"
        ]
    },
    {
        "rule": "wcag:1.3.2",
        "understanding": {
            "brief": " In Brief Goal The order of content can be understood by more people. What to do Use code to preserve meaningful content order. Why it's important Assistive technology can present content to users in the proper order. ",
            "intent": " Intent The intent of this Success Criterion is to enable a user agent to provide an alternative presentation of content while preserving the reading order needed to understand the meaning. It is important that it be possible to programmatically determine at least one sequence of the content that makes sense. Content that does not meet this Success Criterion may confuse or disorient users when assistive technology reads the content in the wrong order, or when alternate style sheets or other formatting changes are applied. A sequence is meaningful if the order of content in the sequence cannot be changed without affecting its meaning. For example, if a page contains two independent articles, the relative order of the articles may not affect their meaning, as long as they are not interleaved. In such a situation, the articles themselves may have meaningful sequence, but the container that contains the articles may not have a meaningful sequence. The semantics of some elements define whether or not their content is a meaningful sequence. For instance, in HTML, text is always a meaningful sequence. Tables and ordered lists are meaningful sequences, but unordered lists are not. The order of content in a sequence is not always meaningful. For example, the relative order of the main section of a Web page and a navigation section does not affect their meaning. They could occur in either order in the programmatically determined reading sequence. As another example, a magazine article contains several callout sidebars. The order of the article and the sidebars does not affect their meaning. In these cases there are a number of different reading orders for a Web page that can satisfy the Success Criterion. For clarity: Providing a particular linear order is only required where it affects meaning. There may be more than one order that is \"correct\" (according to the WCAG 2.0 definition). Only one correct order needs to be provided. ",
            "benefits": " Benefits This Success Criterion may help people who rely on assistive technologies that read content aloud. The meaning evident in the sequencing of the information in the default presentation will be the same when the content is presented in spoken form. ",
            "examples": " Examples Example 1: In a multi-column document, the linear presentation of the content flows from the top of a column to the bottom of the column, then to the top of the next column. Example 2: CSS is used to position a navigation bar, the main story on a page, and a side story. The visual presentation of the sections does not match the programmatically determined order, but the meaning of the page does not depend on the order of the sections. ",
            "key-terms": " Key Terms assistive technology hardware and/or software that acts as a user agent , or along with a mainstream user agent, to provide functionality to meet the requirements of users with disabilities that go beyond those offered by mainstream user agents Note Functionality provided by assistive technology includes alternative presentations (e.g., as synthesized speech or magnified content), alternative input methods (e.g., voice), additional navigation or orientation mechanisms, and content transformations (e.g., to make tables more accessible). Note Assistive technologies often communicate data and messages with mainstream user agents by using and monitoring APIs. Note The distinction between mainstream user agents and assistive technologies is not absolute. Many mainstream user agents provide some features to assist individuals with disabilities. The basic difference is that mainstream user agents target broad and diverse audiences that usually include people with and without disabilities. Assistive technologies target narrowly defined populations of users with specific disabilities. The assistance provided by an assistive technology is more specific and appropriate to the needs of its target users. The mainstream user agent may provide important functionality to assistive technologies like retrieving Web content from program objects or parsing markup into identifiable bundles. Assistive technologies that are important in the context of this document include the following: screen magnifiers, and other visual reading assistants, which are used by people with visual, perceptual and physical print disabilities to change text font, size, spacing, color, synchronization with speech, etc. in order to improve the visual readability of rendered text and images; screen readers, which are used by people who are blind to read textual information through synthesized speech or braille; text-to-speech software, which is used by some people with cognitive, language, and learning disabilities to convert text into synthetic speech; speech recognition software, which may be used by people who have some physical disabilities; alternative keyboards, which are used by people with certain physical disabilities to simulate the keyboard (including alternate keyboards that use head pointers, single switches, sip/puff and other special input devices.); alternative pointing devices, which are used by people with certain physical disabilities to simulate mouse pointing and button activations. correct reading sequence any sequence where words and paragraphs are presented in an order that does not change the meaning of the content programmatically determined determined by software from author-supplied data provided in a way that different user agents , including assistive technologies , can extract and present this information to users in different modalities Determined in a markup language from elements and attributes that are accessed directly by commonly available assistive technology. Determined from technology-specific data structures in a non-markup language and exposed to assistive technology via an accessibility API that is supported by commonly available assistive technology. user agent any software that retrieves and presents Web content for users Web browsers, media players, plug-ins, and other programs — including assistive technologies — that help in retrieving, rendering, and interacting with Web content. ",
            "box": " Success Criterion (SC) When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined . "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G57",
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G57",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H34",
            "https://www.w3.org/WAI/WCAG22/Techniques/html/H56",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C6",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C8",
            "https://www.w3.org/WAI/WCAG22/Techniques/css/C27",
            "https://www.w3.org/WAI/WCAG22/Techniques/pdf/PDF3",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F34",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F33",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F32",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F49",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F1"
        ]
    },
    {
        "rule": "wcag:1.3.3",
        "understanding": {
            "brief": " In Brief Goal Instructions are understandable by more people. What to do Describe controls by name, not just by appearance or location. Why it's important People who are blind or have low vision need non-visual instructions. ",
            "intent": " Intent The intent of this Success Criterion is to ensure that all users can access instructions for using the content, even when they cannot perceive shape or size or use information about spatial location or orientation. Some content relies on knowledge of the shape or position of objects that are not available from the structure of the content (for example, \"round button\" or \"button to the right\"). Some users with disabilities are not able to perceive shape or position due to the nature of the assistive technologies they use. This Success Criterion requires that additional information be provided to clarify instructions that are dependent on this kind of information. Providing information using shape and/or location, however, is an effective method for many users including those with cognitive limitations. This provision should not discourage those types of cues as long as the information is also provided in other ways. In some languages, it is commonly understood that \"above\" refers to the content previous to that point in the content and \"below\" refers to the content after that point. In such languages, if the content being referenced is in the appropriate place in the reading order and the references are unambiguous, statements such as \"choose one of the links below\" or \"all of the above\" would conform to this Success Criterion. WCAG was designed to apply only to controls that were displayed on a web page. The intent was to avoid describing controls solely via references to visual or auditory cues. When applying this to instructions for operating physical hardware controls (e.g. a web kiosk with dedicated content), tactile cues on the hardware might be described (e.g. the arrow shaped key, the round key on the right side). This success criterion is not intended to prevent the use of tactile cues in instructions. ",
            "benefits": " Benefits People who are blind and people who have low vision may not be able to understand instructions if they rely only on a description of the shape and/or location of content. Providing additional information in any instructions other than shape and/or location will allow users to understand the instructions even if they cannot perceive shape and/or location. ",
            "examples": " Examples Example 1: Instructions for interpreting a schedule of competitive events references colored icons in different shapes to indicate the venue for each event A table presents a list of times across the top row and a list of events in the first vertical column and instructions are provided under the table: \"Events marked with a blue diamond are played on field A and events marked with a green circle are played on field B.\" The instructions rely on color and shape only and result in a failure of this criterion. Example 2: An online multi-page survey An online multi-page survey uses a link implemented as a green arrow icon placed in the lower right hand corner of the content to move from one survey page to the next. The arrow is clearly labeled with \"Next\" and the instructions state, \"To move to the next section of the survey, select the green arrow icon labeled 'Next' in the lower right corner below the last survey question.\" The instruction uses positioning and color to help identify the icon; the instruction does not rely on these sensory characteristics since it also refers to the label, so it passes this criterion. ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Content has alternative for visual reference ",
            "box": " Success Criterion (SC) Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, color, size, visual location, orientation, or sound. Note For requirements related to color, refer to Guideline 1.4 . "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G96",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F14",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F26"
        ]
    },
    {
        "rule": "wcag:1.3.4",
        "understanding": {
            "brief": " In Brief Goal Devices can be used in any orientation. What to do Don't lock content to either portrait or landscape presentation. Why it's important Wheelchair users and others may have devices mounted in a fixed orientation. ",
            "intent": " Intent The intent of this Success Criterion is to ensure that content displays in the orientation (portrait or landscape) preferred by the user. Some websites and applications automatically set and restrict the screen to a particular display orientation and expect \t\t\tthat users will respond by rotating their device to match, but this can create problems. Some users have their devices mounted \t\t\tin a fixed orientation (e.g. on the arm of a power wheelchair). Therefore, websites and applications need to support both orientations \t\t\tby not restricting the orientation. Changes in content or functionality due to the size of display are not covered by this criterion which is focused on restrictions of orientation. Historically, devices tended to have a fixed-orientation display, and all content was created to match that display orientation. Today, most handhelds and many other devices (e.g., monitors) have a hardware-level ability to dynamically adjust default display orientation based on sensor information. The goal of this Success Criterion is that authors should never restrict content's orientation, thus ensuring that it always match the device display orientation. It is important to distinguish between an author's responsibility not to restrict content to a specific orientation, and device-specific settings governing the locking of display orientation. Many hand-held devices offer a mechanical switch or a system setting (or both) to allow the user to lock the device display to a specific orientation. Where a user decides to lock their entire device to an orientation, all applications are expected to pick up that setting and to display content accordingly. This Success Criterion complements device \"lock orientation\" settings. A web page that does not restrict its display orientation will always support the system-level orientation setting, since the system setting is picked up by the user agent. Alternatively, where a device-level orientation lock is not in place, the user agent should display the page according to the orientation of the device (either its default, or the current orientation determined by any device sensors). The exception for things considered essential is aimed at situations where the content would only be understood in a particular orientation, or where the technology restricts the possible orientations. If content is aimed at a specific environment which is only available in one orientation (such as a television) then the content can restrict the orientation. Technologies such as virtual reality use screens within goggles that cannot change orientation relative to the user's eyes. ",
            "benefits": " Benefits Users with dexterity impairments, who have a mounted device will be able to use the content in their fixed orientation. Users with low-vision will be able to view content in the orientation that works best for them, for example to increase the text size by viewing content in landscape. ",
            "examples": " Examples Example 1: Online video site \t\t\t\tA video is shown in either portrait or in landscape based on the user's chosen orientation. Example 2: Messaging website \t\t\t\tA messaging website can display messages in both portrait and landscape orientations. Example 3: eReader web app \t\t\t\tAn eReader web app can display the contents of a book in both portrait and landscape orientation. Example 4: Check deposit in banking app \t\t\t\tAn example where orientation is essential could be a banking app that requires the device be in landscape mode to easily and accurately capture an image of a check for deposit. These paper forms are typically about twice as wide as they are high. Example 5: Piano app \t\t\t\tAn example where orientation is essential could be a piano app that requires the device to be in landscape mode to allow room for enough of the piano keys to be functionally usable. Since a piano app is emulating a physical piano keyboard that needs to retain relative physical characteristics between keys, either too few keys would be available, or the keys would be much too narrow. ",
            "resources": " Related Resources Resources are for information purposes only, no endorsement implied. Managing Screen Orientation Using Media Queries Media Queries for Standard Devices Orientation Lock Responsive Design for Landscape Orientation The Orientation Descriptor The Screen Orientation API ",
            "key-terms": " Key Terms essential if removed, would fundamentally change the information or functionality of the content, and information and functionality cannot be achieved in another way that would conform ",
            "test-rules": " Test Rules The following are Test Rules for certain aspects of this Success Criterion. It is not necessary to use these particular Test Rules to check for conformance with WCAG, but they are defined and approved test methods. For information on using Test Rules, see Understanding Test Rules for WCAG Success Criteria . Orientation of the page is not restricted using CSS transforms ",
            "box": " Success Criterion (SC) Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential . Note Examples where a particular display orientation may be essential are a bank check, a piano application, slides for a projector or television, or virtual reality content where content is not necessarily restricted to landscape or portrait display orientation. "
        },
        "references": [
            "https://www.w3.org/WAI/WCAG22/Techniques/general/G214",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F97",
            "https://www.w3.org/WAI/WCAG22/Techniques/failures/F100"
        ]
    }
]